[
  {
    "image": "tips_detox.jpg",
    "tips": "Meditate for 30 min minimum and go out and get fresh air.<br/>Do exercise yoga or running and get your heart pumping more.<br/>Drink lime water in the morning and eat raw fresh fruits and veggies.<br/>Take an herbal supplement that aid natural detoxification process<br/>Go for sauna sometimes that also flushing out toxins from your body",
    "title": "Daily Detox tips"
  },
  {
    "image": "tips_detoxbath.jpg",
    "tips": "<b>Salt detox baths</b> are usually made of <b>Epsom salt</b>, which allows for minerals to \"draw out\" toxins from the body. Supporters may claim that soaking in an <b>Epsom salt bath</b> can remove harmful toxins and balance the body. Salt Detox Bath Recipe is very simple to add ¼ cup sea salt or Himalayan salt, ¼ cup Epsom salt, ¼ cup baking soda, 1/3 cup apple cider vinegar, Essential oils (10 drops of lavender or any). And you are ready for a salt detox.",
    "title": "Detox Bath"
  },
  {
    "image": "tips_propersleep.jpg",
    "tips": "Sleep plays an important role in your physical health. For example, sleep is involved in the healing and repair of your heart and blood vessels. Insufficient sleep is related to some serious health problems, such as <b>heart disease, heart attacks, diabetes</b> and <b>obesity.</b>",
    "title": "Proper Sleep"
  },
  {
    "image": "tips_dopamine.jpg",
    "tips": "If you feel good you will work better and look better. Dopamine is associated with feelings of euphoria, bliss, motivation, and concentration. Dopamine is a type of brain chemical called a neurotransmitter. Following are the ways to incorporate in your daily life to induce Good 7-8 hr sleep, Deep Breath,  Exercises, Massage, Eat banana and Avocado to heal your gut, Listen to Music.",
    "title": "Stimulate Dopamine - a feel-good hormone"
  },
  {
    "image": "tips_vitaminD.jpg",
    "tips": "Vitamin D is essential for strong bones because it helps the body use calcium from the diet vitamin D deficiency has been associated with rickets. Other roles in the body, including modulation of cell growth, neuromuscular and immune function, and reduction of inflammation. Very few food sources available that are The flesh of fatty fish (such as salmon, tuna, and mackerel) and fish liver oils are among the best sources. Small amounts of vitamin D are found in beef liver, cheese, and egg yolks.",
    "title": "Benefits of Vitamin-D"
  },
  {
    "image": "tips_meditation_benefits.jpg",
    "tips": "Reduce stress, Control Anxiety, Promote Emotional health, Increase Self Awareness, Help Generate Feeling of Kindness, Help against Addiction, Improve Sleep, Decrease Blood Pressure.",
    "title": "Meditation Benefits"
  },
  {
    "image": "tips_iron_deficiency.jpg",
    "tips": "Iron is necessary for producing hemoglobin and myoglobin, two proteins that carry oxygen in your blood. You can usually prevent iron deficiency by consuming the right amount of iron in your diet. <br/><b>SOURCES: </b>Meat, poultry, legumes, oysters, tuna, pork, nuts, dark green vegetables, tomato juice, and potatoes are all good sources of dietary iron.",
    "title": "Iron Deficiency"
  },
  {
    "image": "tips_foodcauseinflammation.jpg",
    "tips": "White Sugar, Refined carbohydrates, Meat, Trans fat (in fried food), Dairy products, Alcohol.",
    "title": "Food cause inflammation"
  },
  {
    "image": "tips_bestdoctors.jpg",
    "tips": "Yoga, Raw Food, Water, Rest, Fasting, Sunshine, Meditation, Fresh Air.",
    "title": "8 Best Doctors"
  },
  {
    "image": "tips_oliveoilheat.jpg",
    "tips": "We know that it is also the safest oil for sautéing and other high-temperature cooking. Olive oil is made up of 70-80% of monosaturated fat, oleic acid. Oleic acid gives its health benefit like improved insulin resistance cancer-fighting properties and heart health. But it is unsuitable above 250. ",
    "title": "Do not heat olive oil"
  },
  {
    "image": "tips_processed_food.jpg",
    "tips": "Processed foods are often high in unhealthy fats. They usually contain cheap fats, refined seed and vegetable oils (like soybean oil) that are often hydrogenated which turns them into trans fats.",
    "title": "Avoid processed food"
  },
  {
    "image": "tips_sugar.jpg",
    "tips": "Excess sugar in the diet can be incredibly harmful and has been linked to many chronic diseases, including cancer, type 2 diabetes, heart disease, and obesity. White sugar can cause excessive pain in women at the time of menstruation, increase nervousness and weakness. ",
    "title": "Avoid white sugar"
  }
]