[{"icon":"Carrots.jpg","isSingleItem":true,"layout_type":1,"name":"Carrots","properties":["Rich in vitamin A and beta-carotene(beta-cryptoxanthin), both fight inflammation and reduce the risk of developing arthritis. "],"slug":"Carrots"},{"icon":"Celery.jpg","isSingleItem":true,"layout_type":1,"name":"Celery","properties":["It contains antioxidants and polysaccharides that act as anti-inflammatories, especially flavonoid and polyphenols. Phenolic acids such as caffeic acid and ferulic acid, as well as flavanols such as quercetin."],"slug":"Celery"},{"icon":"Lemon.jpg","isSingleItem":true,"layout_type":1,"name":"Lemon","slug":"Lemon"},{"icon":"Pineapple.jpg","isSingleItem":true,"layout_type":1,"name":"Pineapple","properties":["Pineapple is rich in vitamin C and the enzyme bromelain, linked to decreased pain and swelling in both osteoarthritis and rheumatoid arthritis."],"slug":"Pineapple"},{"icon":"Orange.jpg","isSingleItem":true,"layout_type":1,"name":"Orange","properties":["Rich in vitamin C and getting the right amount of vitamin aids in preventing inflammatory arthritis and maintaining healthy joints with osteoarthritis (OA)."],"slug":"Orange"},{"icon":"Turmeric.jpg","isSingleItem":true,"layout_type":1,"name":"Turmeric","properties":["Tumeric contains curcumin that is beneficial in the management of the chronic inflammatory-related joint disease."],"slug":"Turmeric"},{"icon":"fish.jpg","isSingleItem":true,"layout_type":1,"name":"Fish","properties":["Fish contains inflammation-fighting omega-3 fatty acids. Omega-3-rich fish include salmon, tuna, mackerel, and herring."],"slug":"Fish"},{"icon":"Garlic.jpg","isSingleItem":true,"layout_type":1,"name":"Garlic","properties":["The compound diallyl disulphine found in garlic may limit cartilage-damaging enzymes in human cells. "],"slug":"Garlic"},{"icon":"Broccoli.jpg","isSingleItem":true,"layout_type":1,"name":"Broccoli","properties":["Broccoli has been associated with reduced inflammation. It also contains sulforaphane, which may have anti-inflammatory properties."],"slug":"Broccoli"},{"icon":"Ginger.jpg","isSingleItem":true,"layout_type":1,"name":"Ginger","properties":["Ginger reduce symptoms of arthritis. It may decrease inflammation."],"slug":"Ginger"},{"icon":"Spinach.jpg","isSingleItem":true,"layout_type":1,"name":"Spinach","properties":["Spinach is rich in antioxidants, including kaempferol. Kaempferol can reduce inflammation and slow the progression of osteoarthritis."],"slug":"Spinach"},{"icon":"Walnut.jpg","isSingleItem":true,"layout_type":1,"name":"Walnut","properties":["Walnuts are high in omega-3 fatty acids, which could alleviate arthritis symptoms as well as inflammation."],"slug":"Walnut"}]