{"description":"If you are suffering from asthma you may be curious to know whether certain foods and diet choices help in treating your disease, although there is very less evidence that a specific diet help in improving the condition of asthma.\n\nEating fresh and high nutrition foods may help in improving overall health as well as asthma, let's quickly discuss food to eat and avoid:","details":[{"full_description":"There is no specific food recommended for asthma but here are some foods that help or support lung function:","header":"Foods to add to your diet:","image":"article_53_1.jpg"},{"full_description":"Getting enough vitamin D may help in reducing asthma attacks number in children aged 6 To 15, Some sources of vitamin D are <b>Salmon, Milk, Orange juice, and eggs.</b> ","header":"Vitamin D Rich foods:","image":""},{"full_description":"Vitamin A deficiency is found in children suffering from asthma, you can fulfill their needs by following foods - <b>carrots, cantaloupe, sweet potatoes, broccoli</b> and so on. ","header":"Vitamin A rich foods:","image":""},{"full_description":"One study found out that children ages 11 to 19 who had low magnesium levels also had low lungs flow, kids can improve their magnesium by adding these foods to their diet- <b>spinach, pumpkin seeds, swiss chard, dark chocolate, and salmon.</b>","header":"Magnesium:","image":""},{"full_description":"<b>1.</b> Sulphites is a type of preservative that may worsen asthma, It is found in wine, dried fruits, bottled lemon, and so on.<br/><br/><b>2. </b>Foods that can cause you gas problem such as onions, beans, and cabbage.<br/><br/><b>3. </b>Avoid artificial ingredients like flavouring and chemical preservative.","header":"Foods to avoid:","image":""},{"full_description":"These changes in your diet will not only help you in fighting against asthma but also helps in improving overall health of your body and help in reducing weight, we suggest you before adding any foods to your diet first consult with your doctor.","header":"","image":""}],"title":"Diet for Asthma - what to eat and avoid"}