{"description":"Maintaining good health means keeping a check on the immune system.  If we have a strong immune system then it can protect us from diseases and illnesses.\n\nAs the change in lifestyle and habits are occurring, maintaining immunity is getting adversely affected. \n\nSome evidence even says that nutrition and other lifestyle measures influence immune strength and susceptibility to infectious diseases.\n\nAdopting the right practices can improve our health and well being.\n\nSo, for the people who are still contemplating where they should start. People need to follow or need to indulge these few habits in their lives as quickly as they can implement.","details":[{"full_description":"Water is one of the main sources for the immune system. It is essential for the functioning of kidneys and removing toxins from the body. It ensures that the immune system should regain its strength.<br/><br/>People are aware of the benefits of water. Along with water, one can intake water-enriched foods in a daily diet.","header":"By keeping body hydrated","image":"article_26_1.jpg"},{"full_description":"Our harsh lifestyle affects our health and body very badly. It is vital to give adequate rest to our body.<br/><br/>Doctors recommend that we should sleep for 7-8 hours and it is extremely essential. This will regulate your sleeping pattern and help to regularise too.<br/><br/>Your body and brain need to settle and calm down and if not then without it the immune system will not  get time to rebuild.","header":"Complete your sleep cycle","image":""},{"full_description":"A balanced diet plays a key role in improving immunity. For maintaining immunity one must include fruits, vegetables and cereals as they are rich in vitamins and fibre.<br/></br><b>NOTE</b>: Stay away from tobacco and alcohol as they weaken the immune system.","header":"Eat healthy","image":""},{"full_description":"The human brain needs to rest. Because sleeping less will make your body more tired and will affect your brain activity.<br/><br/>This might cause the impairment of body functions thus directly impacting the body functions.","header":"Exclude stress","image":""},{"full_description":"Exercising adds several benefits to the immune system. Exercise is a mandatory part. As it helps to remove unwanted particles and toxins from the body.<br/><br/>Falling ill is a sign of weak immunity. Keep a check on your immunity and work on a healthier lifestyle.<br/><br/>Despite its complexity, everyday lifestyle habits can help your immune system do what it needs to fight whether it's infection or illness.","header":"Exercise and meditate","image":""}],"title":"How To Strengthen Immunity Naturally"}