{"description":"Diabetes has become a very common problem not only for elders but also for youngsters worldwide it is due to increase intake of unhealthy foods but sometimes diabetes in generational as well as it comes with age also. The change in your lifestyle can prevent you from diabetes, the most common form of diabetes is  Type 2 diabetes which is chronic disease  effecting millions of people in world, in severe cases it can  cause eye blindness, kidney failure, heart disease, etc.\nThere are certain factors that you can't change such as genes, age but taking certain precautions and following below actions can surely help you in reducing diabetes","details":[{"full_description":"It is one of the effective ways to control diabetes by exercising regularly your body increases the insulin sensitivity , which helps in preventing progression from prediabetes stage to diabetes.","header":"<b>Do exercise daily</b>","image":"article_37_1.jpg"},{"full_description":"The majority of people who are suffering from type 2 diabetes are overweight or obese, the excess weight in your mid section of body & near abdominal organs like liver is called visceral fat, it promotes insulin resistance which increases the risk of diabetes.<br/>What's more, one study find out that loosing small amount of fat can reduce the risk of diabetes. the more fit your body is the less chance of yours to get effected.","header":"<b>Lose weight if you are overweight </b>","image":""},{"full_description":"Minimize the intake of processed food and increase foods which are rich in vitamin D & eat high fiber diet like avocado, apples, bananas etc also try to add low carb diet in your plan which can help to keep insulin and blood sugar under control.","header":"<b>Optimize your Diet plan</b>","image":""},{"full_description":"If you are suffering from diabetes then this is a very important step to be taken because sugar increases blood sugar level and insulin level which lead to diabetes overtime, limit intake of refined carbohydrates like white bread, cereals, potatoes and increase intake of complex carbohydrate such as vegetables, oatmeal, wholegrains.","header":"<b>Cut down sugar and refined carbohydrates</b>","image":""},{"full_description":"If you are been suffering from type 2 diabetes then from immediate effect you need to remove alcohol from your lifestyle also smoking is been strongly linked to increasing the risk of diabetes whereas quitting has shown significant result in  reducing the risk over time.","header":"<b>Quit drinking and smoking</b>","image":""}],"title":"5 tips to Control diabetes"}