{"description":"Pineapple is a very delicious fruit and many cultures worldwide use it as a fruit and juice to prevent various ailments, modern researchers have found several benefits of it such as a healthy heart, improve digestion, reduce inflammation, and many more. \nHowever, not all evidence is conclusive, check out 5 health benefits of pineapple juice:","details":[{"full_description":"Pineapple juice is loaded with vitamins and minerals, some unique nutrients are copper, vitamin, manganese, B6, and vitamin C- all of these are very crucial for your body. It also contains Zinc, choline, iron, calcium, and vitamin K in very minute quantities.","header":"<b>Rich in Nutrients:</b>","image":"article_49_1.jpg"},{"full_description":"Pineapple juice is a very good source of antioxidants, which keeps your body healthy. it also contains bromelain a group of enzymes that may reduce inflammation, improve the digestion system, and boost immunity.","header":"<b>Rich In Antioxidants:</b>","image":""},{"full_description":"Pineapple might help in boosting your immunity by making your immune system strong, it may also help in increasing the effectiveness of antibiotics. more study is still needed.","header":"<b>Boost immunity:</b>","image":""},{"full_description":"The bromelain is present in pineapple juice may aid digestion, guard against diarrhea, reduce inflammation. the enzymes in pineapple function as proteases, it help in breaking down protein into smaller subunits such as amino acids and peptides.","header":"<b>Aid Digestion:</b>","image":""},{"full_description":"The bromelain found in pineapple may also help your heart,Test-tube study and animal study shown that bromelain may help reduce blood pressure, prevent blood clots formation, and help in minimizing heart diseases.","header":"<b>Promote heart health:</b>","image":""},{"full_description":"Pineapple juice is loaded with minerals and vitamins, it helps in improved digestion, heart health, and immunity. what's more, the beverage remains low in fiber and rich in sugar, so drinking too mush is not good for your health.","header":"","image":""}],"title":"5 Health benefits of Pineapple"}