{"description":"","details":[{"full_description":"Most of us will say, \"YES\" because without a proper care and concern we will not be able to live up to the fullest.<br/><br/>But ever thought that without eating healthy food, wasting huge amounts of money and time in the gym can help us live our lives in a healthy and better way?<br/><br/>People on a guess work would say, \"In our busy schedule we need to do these things as we don't have much time to do other things.\"<br/><br/>They do have time for gymming but not for themselves.<br/><br/>Few people do spend their time indoors for homegrown products and care about every single pinch of work a fruit needs. Planting few fruits and vegetables at home is another hobby or can say that most people love to grow fruits and vegetables like their own kids growing up.","header":"Is it really a must for a person to live a healthy lifestyle? ","image":"article_12_1.jpg"},{"full_description":"The most beneficial part of the indoor plantation is that they are chemical free. Growing plants indoors helps to improve your health and also the house environment. <br/>Additionally, a study has shown that having some fresh air also reduces your stress when you have homegrown plants.<br/><br/>Indoor plants are not for just good looks-- they make you feel good too. After a long time in your workplaces having a walk on a green surface and feeling that little wind on your face makes you feel lively.<br/><br/>Impact of plants has an elegant value. They distinguish between integrity of life and nature which occurs during your stay with your indoor plants and happiness of being living in your life. Some of the plants fulfil our medicinal needs like neem, tea tree, chamomile, ginger etc.","header":"","image":"article_12_2.jpg"},{"full_description":"Sometimes it helps in purifying your skin glow making you feel energetic. It's a beneficial addition for better character and a responsible person for every single thing you need to workout.<br/><br/>Such things make you feel more independent, confident, breaking yourself from the fear of getting into the vicious circle of using harmful chemical cosmetics which ruins your skin leading it to deterioration.","header":"","image":"article_12_3.jpg"},{"full_description":"It is beneficial for our perspective of looking at things ,as plants require much care, the ones who do this, know these are the ones who conquer in achieving a healthy and wealthy life. Others just enjoy the external beauty, living in a world of illusion and dilemma.","header":"","image":"article_12_4.jpg"}],"title":"Indoor plants health benefits"}