{"description":"We all want a fit body and a healthy mind, If you are looking to start your fitness journey you need to follow a disciplined workout plan and diet plans in order to get in shape but it is very crucial to detox your body so that harmful toxins get released from the body.\n\nDue to our tight schedules, it is very typical for all of us to follow detox programs, If you wish to detox your body here are some foods that help your body to detoxify naturally :","details":[{"full_description":"Lemon is a rich source of vitamin C which is good for the skin and fighting free radicals also lemon has an alkaline effect on your body, it helps in improving the immune system. Lemon is been added to many detox diets plans.","header":"<b>Lemon:</b>","image":"article_44_1.jpg"},{"full_description":"Ginger is not only a great source of reducing nausea but also it helps in improving your digestion system and reducing gas problems, if oily foods have caused damage to your digestive system then you can add ginger to improve your digestion system, also helps in detoxifying your body.","header":"<b>Ginger:</b>","image":""},{"full_description":"Beetroot is rich in iron, magnesium, and vitamin C, also it helps in detoxifying the liver, making it an ultimate option to add to your diet plans, it is been recently hailed as a superfood.","header":"<b>Beetroot:</b>","image":""},{"full_description":"Although it is not a food, no detox plan is completed without regular consumption of essential liquid, green tea is high in antioxidants, and also it helps in reducing weight, it helps in flushing out toxins from the body. ","header":"<b>Green Tea:</b>","image":""},{"full_description":"So, these are some foods that can add to your daily routine if you are looking to detoxify your body, you can add some other ways that are also very effective in rejuvenating your body such are: limit alcohol intake, drinking more water daily, good sleep, reduce intake of sugar content and processed foods, and decrease your salt intake. by following these methods and adding foods to your diet you can detoxify your body more naturally at a good pace.","header":"","image":""}],"title":"Foods that help in detoxify your body"}