{"description":"Lemons are an excellent source of vitamin C. Vitamin C is an antioxidant and has been known to help your skin, immune system and reduce the risk of complications.","details":[{"full_description":"Vitamin C and antioxidants are the two nutrients that are beneficial for heart health and help prevent heart diseases and stroke. And hopefully both the nutrients are present in lemon.<br/><br/>Amount of fibres present in lemon can also lower some risk for heart diseases.Consuming lemon juice can help reduce high blood pressure.","header":"Supports Heart Health","image":"article_21_1.jpg"},{"full_description":"It helps strengthen the immune system against germs that cause the common cold and the flu. A glass of hot water with lemon juice and a large spoonful of honey can help aid cough and cold because lemons boosts our immune system.","header":"Help To Boost Immunity","image":""},{"full_description":"Lemon has soluble fibres that helps to maintain the bowel movements and improves digestion. Pectin, the main fiber in lemons, helps to improve gut health.<br/><br/>It is said that drinking a glass of water with lemon juice in the morning can kick-start your digestion process as it will help your digestion to be healthy.","header":"May Improve Digestion","image":""},{"full_description":"Squeezing lemon in a glass of lukewarm water with a tablespoon of honey can be an aid in weight loss. As it has a fibre that expands after ingestion, making you feel full sooner and longer.","header":"Help To Control Weight","image":""},{"full_description":"Lemon and lemon juice are a rich source of vitamin C and antioxidants that help fight against deadly diseases like cancer. Compounds that are present in the lemon i.e. limonene and naringenin have anti-cancer properties.","header":"Help To Reduce Cancer Risk","image":""},{"full_description":"Being a rich source of vitamin C, lemon is beneficial for oral disorders. Scurvy is a disease resulting from a lack of vitamin C leading to swollen gums, bleeding gums, etc.<br/><br/>Lemon juice may have that much audacity to cure the pain when applied locally to areas.","header":"May Help In Oral Disorders","image":""},{"full_description":"Collagen gives our skin a plump and flawless look. It helps to reduce the fine lines on the face and make your skin clear.","header":"Beneficial For Skin","image":""},{"full_description":"Lemon is a small yet power-packed fruit with all nutrients. Consuming lemon juice as part of a varied diet can make a person’s diet more nutritious and healthful. Lemon can be helpful with the main line of treatment of high blood pressure. Lemon contains two plant-compounds, such as hesperidin and diosmin — known to lower cholesterol.","header":"","image":""}],"title":"Health Benefits Of Lemon"}