{"description":"Coffee is been considered a beloved beverage worldwide for its energizing effects not only this a daily cup of coffee is linked with several benefits in long run. \nCoffee contains caffeine which helps in improving your focus, gives a quick refreshment, and boosts your energy levels, coffee is been consumed worldwide and people kickstart their day with it.","details":[{"full_description":"Coffee contains caffeine a stimulant that helps in increasing energy levels of the body and also decreases fatigue by altering levels of certain neurotransmitters inside the brain.","header":"<b>Increase energy level:</b>","image":"article_48_1.jpg"},{"full_description":"Coffee helps in reducing weight, according to some research coffee alter fat storage and support your body to do workout more effectively. One research also found that people who consumed coffee were more likely to be physically active.","header":"<b>Help in weight management:</b>","image":""},{"full_description":"Coffee is been used worldwide as a refreshment drink that helps in boosting the body, from morning cup to late knight study coffee, people consume it worldwide as per their preference as it is been considered as the best drink you can take to recharge yourself instantly.","header":"<b>Super refreshment drink:</b>","image":""},{"full_description":"Some research has suggested that coffee might help in protecting against certain disorders like Alzheimer's, and Parkinson's disease. and also protects against cognitive decline. although further research is still needed for more clarity on this.","header":"<b>Protects brain health:</b>","image":""},{"full_description":"Coffee work as a performance enhancer if taken as a pre-workout, one study shows drinking coffee is associated with improved physical performance, a large sample report has also shown that moderate consumption could slightly improve physical performance and endurance when consumed before a workout. Although we suggest you to first discuss it with your doctor before adding it to your pre-workout meal.","header":"<b>Boost athletic performance:</b>","image":""},{"full_description":"Coffee is one of the most popular beverages in the whole world searchers have studied several health benefits including its ability to boost energy, manage weight, enhance athletic performance, and protect against diseases.","header":"","image":""}],"title":"Impressive benefits of coffee"}