{"description":"","details":[{"full_description":"Following a diabetes diet does not mean giving up the joy of eating or avoiding your favorite foods and special family meals. You can still enjoy “pizza night,” celebrate birthdays and anniversaries, and partake in holiday meals and vacation dining. This lies more on your routine food choices and meal planning.<br/><br/>Making wise food adjustments than it is about denial and deprivation but the better way to look at a diet is one that helps you establish new normal eating habits and food choices.<br/><br/>For those with prediabetes or type 2 diabetes, the main focus of a diabetes-focused diet is being attentive to your weight. A diabetic diet is simply an eating approach that works to keep you healthy.","header":"","image":"article_15_1.jpg"},{"full_description":"<b>*</b> Leafy green vegetables are extremely nutritious and low in calories.<br/><b>*</b> Avocados have less than 1 gram of sugar, few carbs, high fiber and fats.<br/><b>*</b> <br/><b>*</b> Eggs improve insulin and increase good cholesterol.<br/><b>*</b> Chia seeds and flax seeds are best in diabetes as they are high in fibre.<br/><b>*</b> Beans are super healthy and rich in B vitamins, minerals and fiber.<br/><b>*</b> Greek yogurt is great in curing diabetes.<br/><b>*</b> All types of nuts contain fiber and are low in net carbs.<br/><b>*</b> Broccoli helps manage your blood sugar levels and is one of the most nutritional vegetables.<br/><b>*</b> Olive oil is beneficial for heart health.<br/><b>*</b> Strawberries are low-sugar fruits that have strong anti-inflammatory properties and may help improve insulin resistance.","header":"Some of the healthy and best food for controlling diabetes are:","image":"article_15_2.jpg"},{"full_description":"Exercise can help manage your weight and may improve your insulin sensitivity. Starting exercising for 30 minutes a day is a must. You can try other moderate-intensity activity that has you working up a light sweat and breathing harder.<br/><br/>In addition, a diabetes meal plan can help an individual to keep a track of carbs and calories and make healthful eating more interesting by introducing some new ideas to the diet.<br/><br/>A person should work out their own meal plan with help from a doctor or dietitian.","header":"","image":"article_15_3.jpg"}],"title":"Healthy diet for diabetic free life"}