{
  "description": "Whatever we eat in the morning sets our whole course of the day. Keeping in mind what we should eat and what we should avoid in the morning.\n\nIntake of nutrients is vital for our well being. As for our surroundings the nature of our lives makes it hard to delve, especially when it comes to the choices.\n\nBreakfast is a meal from which we start our day living on food and intake an empty stomach. It is not just about eating healthy food. To improve the digestion and maximize the nutrients intake we need to choose the correct food which can really help out.\n\nThe main goal or a reason is to understand how to optimize the food that we eat. Some issues that happen while wrong intake of food on an empty stomach causes many issues. \n\nOne needs to make choices, therefore few foods that one must avoid on an empty stomach are:",
  "details": [
    {
      "full_description": "Eating spicy food on an empty stomach may  create irritation in the stomach which can lead to acidic reactions and cramps. Which makes your stomach and create gastric issues and can trigger indigestion.",
      "header": "Spicy Food",
      "image": "article_29_1.jpg"
    },
    {
      "full_description": "It is really good and healthy to have a glass of fruit juice to start your day but while the stomach is empty, sugar can be an overload on your liver. Processed sugar is worse on an empty stomach, try to avoid breakfast desserts or overly sweet smoothies.",
      "header": "Sugary foods or drinks",
      "image": ""
    },
    {
      "full_description": "The fact that people have that yogurt is healthy and promotes weight loss but for notification all yogurts are not a good option. But in need of it one of the safest options would be plain Greek-style yogurt in which you can sweeten it yourself with honey or fruit whatever is convenient.",
      "header": "Yogurt",
      "image": "article_29_2.jpg"
    },
    {
      "full_description": "Oatmeal is a healthy option for breakfast, as it is high in fiber, vitamins, protein, and does not contain gluten.<br/><br/>Selecting instant oatmeal packages contain added sugar, salt, and artificial coloring. If you really don't have time to prepare regular oats, try to choose the unsweetened and plain one.",
      "header": "Oatmeal",
      "image": ""
    },
    {
      "full_description": "Having citrus fruits on an empty stomach should be avoided by those who are diagnosed with diabetes and those who have sensitive stomachs.<br/><br/>Fruits such as oranges, lemons, limes, and grapefruit can negatively react which can cause irritation, heartburn, and gastric problems.",
      "header": "Citrus fruits",
      "image": "article_29_3.jpg"
    },
    {
      "full_description": "Salads are a better choice for lunch. Though raw vegetables are full of fibre, they can put an extra load on an empty stomach which is not good. They can cause flatulence and abdominal pain.",
      "header": "Salads",
      "image": ""
    },
    {
      "full_description": "A bowl of cereal is a convenient meal for breakfast, but it contains a large amount of sugar and refined carbs are bad for you.",
      "header": "Cereals",
      "image": "article_29_4.jpg"
    },
    {
      "full_description": "It is really hard to resist fresh baked bread or savories or cupcakes but unfortunately, having them in breakfast may lead to health problems such as abdominal pain and gas in the stomach.",
      "header": "Baked yeast products",
      "image": ""
    },
    {
      "full_description": "It is important to be cautious when you are eating and what you are eating. We have endless choices of food but finding the best and right food for your health is a task.<br/><br/>We have various alternatives which can be consumed on an empty stomach. At that point whether it be fruits or something else. Try to stick to the variety available that is both healthy and delicious.",
      "header": "",
      "image": ""
    }
  ],
  "title": "Foods To Avoid In Empty Stomach"
}