{"description":"Health conscious people constantly look out for different type of foods  to burn fat, in order to reduce excess body fat many people try different type of tablets, supplement etc. which some time leads to side effects like damaging kidney, kidney stone,  dehydration, digestive problems.\n\nIf you are looking to loose weight then here are some foods that can actually help you in reducing body fat more naturally with minimal side effects, below foods are scientifically proven to burn body fat when taken in a precise diet plan.","details":[{"full_description":"","header":"5 Best fat burning Foods for weight loss :","image":"article_36_1.jpg"},{"full_description":"Broccoli is one of the best foods you can add in your diet plan , broccoli is super rich in calcium, nutrients & fibre and low in fat which help in burning fat.","header":"1. <u>Broccoli</u>","image":""},{"full_description":"Adding green tea to your diet plans can do wonders in your weight loss process, green tea includes antioxidants which helps in improving your metabolism, researcher has found it very effective in burning body fat when taken before exercise, 2-3 cups of green tea can help you in reducing weight faster.","header":"2. <u>Green tea</u>","image":""},{"full_description":"Start your morning with a oat meal breakfast , oat meal is a whole-grain carbs and which is very good source of calories  low in sugar & helps in burning body fat when taken regularly. ","header":"3. <u>Oat meal</u>","image":""},{"full_description":"Lemon water is very low in calories, replacing it with other high calories beverages can help in you in weight loss.","header":"4. <u>Lemon water</u>","image":""},{"full_description":"Drinking bottle gourd juice on daily basis helps you in reducing body fat and also energizes you as it having Vitamin A, Vitamin K, Vitamin E, Folate, iron, magnesium and potassium, it is recommended partially for weight loss as it has diuretic effect.","header":"5. <u>Bottle gourd</u>","image":""},{"full_description":"These are 5 fat burning foods which you can include in your diet plan for effective results in weight loss, by adding these foods in your daily routine you can reduce body fat at higher rate.","header":"","image":""}],"title":"5 Best fat burning foods"}