{"description":"Foods help in boosting your immunity system and help in preventing colds, Flu, and other infections although you need to understand that eating good foods that boost your immunity can't cure the disease. Together these things will surely help you in fighting against disease, managing your immunity well, daily exercise or yoga, regular check-ups.\n\nIn all the above text healthy food intake is very important to boost your immunity, check out below foods which helps in boosting your immunity:","details":[{"full_description":"Vitamin C is a very crucial component in order to fight against infection, almost every citrus fruit is high in vitamin C such fruit are grapefruit, oranges, lemons, limes.","header":"<b>Citrus fruit:</b>","image":"article_42_1.jpg"},{"full_description":"It is a rich source of beta carotene, which your body converts into vitamin A helps keep your eyes and skin healthy and nourishing, also it is a rich source of vitamin C.","header":"<b>Red Bell Peppers:</b>","image":""},{"full_description":"Broccoli is loaded with vitamins and minerals like vitamins A, C, and E and fiber and lots of antioxidants, Research has shown that steaming is considered as the best way to keep more nutrients.","header":"<b>Broccoli:</b>","image":""},{"full_description":"Kiwis are loaded with essential nutrients such as folate, potassium, vitamin K, C. Kiwi is a good source of vitamin C, Vitamin C boosts white blood cells to fight infections.","header":"<b>Kiwi:</b>","image":""},{"full_description":"Yogurt is a good source of vitamin D, vitamin D helps in regulating the immune system and is thought to boost our body's natural defenses against viruses.","header":"<b>Yogurt:</b>","image":""},{"full_description":"Eating the right foods is a very good start and parallelly you can go for yoga, exercise and other ways to boost your immunity, the above-discussed foods will provide you very big support in improving your immune system to work properly.","header":"","image":""}],"title":"Impressive Food to Boost Immunity"}