{"description":"Guava fruits contain edible seeds, guava gives several health benefits and not only its fruit but its leaves are been used as a herbal tea. Guava fruit is loaded with antioxidants, fiber, vitamin C, and potassium\n\nThe nutrients in guava help in providing several health-related benefits, let's quickly check out some health benefits of guava:","details":[{"full_description":"Studies show that guava helps in reducing the blood sugar level and helps for long-term sugar control, it gives aid to diabetes patients or also helps those who are at risk of getting diabetic.","header":"Control Blood pressure:","image":"article_68_1.jpg"},{"full_description":"Guava is high in potassium and soluble fiber which helps in improving heart health by reducing blood pressure also helps in decreasing LDL \"Bad\" cholesterol and raise HDL \"Good\" cholesterol.","header":"Improve heart health:","image":""},{"full_description":"Guava is one of the richest sources of vitamin C, it contains almost 4times more vitamin C in comparison to oranges. Vitamin C helps in boosting immunity and also helps in protecting against common infections and pathogens.","header":"Boost immunity:","image":""},{"full_description":"Guava is a very good source of Vitamin A and C and antioxidants like carotene and lycopene which help protect the skin from wrinkles and give a glow on your face.","header":"Wrinkle-free skin:","image":""},{"full_description":"Special thing about guava is they are rich in fiber and low in calories but at the same time it is packed with vitamins and minerals. one guava fruit contains 12% of daily fiber intake with just 37 calories.","header":"Help in weight loss: ","image":""},{"full_description":"What's more, guava may also have anti-cancer properties due to its high level of antioxidants, also it helps in improving your digestive system, and helps relieve painful symptoms of menstruation. Guava fruit is loaded with nutrients, fiber, and is low in calories which makes it an excellent addition to your dour diet.","header":"","image":""}],"title":"Health benefits of Guava"}