{"description":"Pomegranates are wonderful and easy to enjoy. They are round in shape with a reddish yellowish colour on the top.","details":[{"full_description":"Pomegranate intake is a better option for maintaining heart health. Research said that pomegranate has antihypertensive (blood pressure lowering) and anti heterogenic (fat deposition in the arteries) properties.<br/><br/>They can help in controlling increased cholesterol. Its seed oil is very useful for heart health in elders. This oil can help prevent the overall lipid profile.","header":"Maintain Heart Health","image":"article_18_1.jpg"},{"full_description":"Pomegranate contains alexic, gallic and oleanolic acid, the presence of these acids exhibit antidiabetic (blood sugar lowering) properties.","header":"Helpful in Diabetes Control","image":""},{"full_description":"Pomegranate is also helpful for cancer prevention because this fruit exhibits anticancer properties, due to the polyphenols.<br/><br/>Polyphenol reduces the development of cancer-causing malignant tumours. Hence, pomegranate can prevent cancer to some extent.<br/><br/><b>NOTE</b>: Nevertheless, do not ignore the fact that cancer is a fatal disease. If someone suffers from this, it is necessary to get complete treatment from a doctor.","header":"Reduce The Risk Of Cancer","image":""},{"full_description":"Pomegranate contains fibre and other essential nutrients which are necessary for the digestive system.<br/><br/>Regular consumption helps in constipation as it has anti-inflammatory properties.<br/><br/>It helps to correct problems in the gastrointestinal tract such as ulcerative colitis. Also, pomegranate has an anti-Helicobacter pylori effect. Thus, it's highly beneficial for elders digestive system.","header":"Benefits the Digestive System","image":""},{"full_description":"The antioxidant, antibacterial, and antiviral properties found in pomegranate seeds can improve immunity.<br/><br/>Eating pomegranate seeds can help in fighting various types of bacteria and viruses.Therefore, pomegranate can also help protect against other diseases caused by weak immunity.","header":"Increases Immunity","image":""},{"full_description":"Pomegranate seeds contain effective anti-inflammatory properties, that strengthens the bones and helps in diseases like Arthritis.It also destroys enzymes that cause arthritis.","header":"Strengthens Bones","image":""},{"full_description":"This fruit is beneficial in controlling BP. It produces good cholesterol by eliminating bad cholesterol from the body and does not allow any kind of blockage in the arteries.","header":"Control Blood Pressure","image":""},{"full_description":"As pomegranate has anti-inflammatory properties, it may be helpful in relieving stomach related inflammation.<br/><br/>Research even showed that this property can reduce various physical problems caused by inflammation. Regular consumption can also be useful in relieving inflammation of joints caused by arthritis.","header":"Rich in Anti-Inflammatory Properties","image":""},{"full_description":"Pomegranate is proven to be beneficial for those who are trying to lose weight,as its extracts may be helpful in controlling weight.<br/><br/>Some studies even showed that pomegranate leaves can reduce hunger. This can be a reason that pomegranate leaves helps in the prevention of increased weight due to high-fat food.","header":"Helpful In Weight Loss","image":""},{"full_description":"Pomegranate can be used to prevent bacterial and fungal infections. Pomegranate juice has antimicrobial properties which may reduce the effect of microbial bacteria.<br/><br/>As it's seeds and peels have antifungal properties. Hence, we can say that it's peel and seeds can reduce the effects of both bacteria and fungus.","header":"Protect Against Bacteria And Fungus","image":""},{"full_description":"People who suffer from kidney issues can get some relief by consuming pomegranate. Some researchers also made this clear.<br/><br/>Pomegranate has anti-hypercalciuria (controlling calcium) and anti-urolithiasis (inhibiting stone formation) effects. Hence, consuming pomegranate can be beneficial in kidney stone problems.","header":"Relief in Kidney Stone Problem","image":""},{"full_description":"Intake of pomegranate can reduce oxidative stress and inflammation in the body. As it helps in reducing excess fat accumulated in the liver.<br/><br/>It also helps to improve the liver function in jaundice. Also, it can relieve fatty liver problems to some extent, in elders.","header":"Relaxation In Fatty Liver Problem","image":""},{"full_description":"Pomegranate is not just a fruit, it has many incredible benefits that will make you look stum. Some studies showed that pomegranate has antioxidants, anti-inflammatory agents and has been treated as medicine for years. It is also regarded as a super skin food.","header":"","image":""}],"title":"Health benefits of pomegranate"}