{"description":"Your gut needs additional help in removing waste from your digestive system and that's where fiber can help. There are several types of fiber that may promote weight loss, helps in lower blood pressure, and fight constipation. \n\nA study found out that around 90% of adults and children don't meet their daily fiber intake, fortunately, you can increase your fiber intake by just adding some foods to your diet plan. let's quickly check out foods that are high in fiber:","details":[{"full_description":"Lentils are considered one of the most nutritious food, it is high in protein and rich in several nutrients. Lentils contain 7.3 grams of fiber per 100 grams.","header":"Lentils:","image":"article_69_1.jpg"},{"full_description":"Avocado is a very unique fruit, it is high in Vitamin C, potassium, magnesium, Vitamin E, and some B vitamins. Avocados contain 6.7 grams of fiber per 100grams.","header":"Avocado:","image":"article_69_2.jpg"},{"full_description":"Raspberries are highly nutritious and are loaded with vitamin C and manganese, 6.5 grams of fiber per 100 grams.","header":"Raspberries:","image":"article_69_3.jpg"},{"full_description":"Kidney beans are loaded with plant-based protein and several nutrients, it contains 6.8 grams of fiber per 100 grams.","header":"Kidney beans:","image":"article_69_4.jpg"},{"full_description":"Oats are among the healthiest food available on the planet, they are rich in vitamins, minerals, and antioxidants. Oats contain a soluble fiber called beta-glucan, which helps in blood sugar and reduces cholesterol levels. oats contain 10.1 grams of fiber per 100 grams.","header":"Oats:","image":"article_69_5.jpg"},{"full_description":"Almonds are high in nutrients including healthy fats, vitamin E, manganese, and magnesium. almonds contain 13.2 grams of fiber per 100 grams. ","header":"Almonds:","image":"article_69_6.jpg"},{"full_description":"Chia seeds are rich in nutrients, magnesium, phosphorus, and calcium. Chia seeds are the single best source of fiber on the planet. chia seeds contain 34.4 grams of fiber per 100 grams. ","header":"Chia seeds:","image":"article_69_7.jpg"},{"full_description":"If you are on weight loss you must increase your fiber intake as fiber helps in weight loss, lower blood sugar levels, and fight constipation. Try adding some of the above foods to your diet to increase your fiber intake. ","header":"","image":""}],"title":"Top 7 Foods Rich in Fiber"}