{"description":"","details":[{"full_description":"Over the years, carbohydrates have gotten a bad reputation. Rapid weight loss that can be very attractive to someone trying to lose weight.<br/><br/>By restricting the amounts of carbohydrate that you eat, these diets claim that you can turn your body into a fat-burning machine. When you limit carbohydrates, however, you deprive your body of a main source of fuel — and many essential nutrients that you need to stay healthy.<br/><br/>Carbohydrates contain carbon, hydrogen and oxygen atoms.<br/><br/>In the world of nutrition, this component is one of the most disputed contexts.<br/><br/>Some believe eating fewer carbohydrates is the way to optimal health, while others prefer higher-carb diets. Still, others insist moderation is the way to go.<br/><br/>No matter where you fall in this debate, it’s hard to deny that carbohydrates play an important role in the human body. This article highlights their key functions.","header":"","image":"article_13_1.jpg"},{"full_description":"Most of the carbohydrates in the foods you eat are digested and broken down into glucose before entering the bloodstream.<br/><br/>Glucose in the blood is taken up into your body’s cells and used to produce a fuel molecule called adenosine triphosphate (ATP) through a series of complex processes known as cellular respiration. Cells can then use ATP to power a variety of metabolic tasks.<br/><br/>Most cells in the body can produce ATP from several sources, including dietary carbohydrates and fats. But if you are consuming a diet with a mix of these nutrients, most of your body’s cells will prefer to use carbs as their primary energy source..<br/><br/>Unlike liver glycogen, the glycogen in your muscles can only be used by muscle cells. It is vital for use during long periods of high-intensity exercise. Muscle glycogen content varies from person to person, but it’s approximately 500 grams.","header":"","image":""},{"full_description":"In circumstances in which you have all of the glucose your body needs and your glycogen stores are full, your body can convert excess carbohydrates into triglyceride molecules and store them as fat.<br/><br/>The nutrients found in whole grains include essential fatty acids: the B vitamins, folate, vitamin E, zinc and magnesium. Whole grains also have fiber. Fruit and starchy vegetables contain many vitamins and minerals, as well as phytonutrients. Phytonutrients are compounds that form a plant's immune system. They help prevent disease in humans when eaten. Phytonutrients include carotenoids and flavonoids.","header":"","image":"article_13_2.jpg"}],"title":"Is carbs a needed nutrient?"}