{
  "description": "As people start to age, their bodies begin to break down and they feel tired. Aging is one of the main reasons which develops the aches and pains and affects the health conditions.\n\nTo slow down the aging process, the steps that are described underneath can somewhere help you in the pledge to keep yourself shining and rejuvenating rather than making you feel dull and tired.",
  "details": [
    {
      "full_description": "Being active throughout your life benefits you in the short and long period of time. Exercise gives more flexibility and makes our muscles stronger and last but not the least it increases our metabolism as well.<br/><br/>These benefits not only help you cure aging but also take care of joint pain, energy, and sometimes it prevents chronic issues too.<br/><br/>You do not need to do intense exercise or stress your body more than it is required as it can harm you in a really bad way.<br/><br/>One of the best exercises and it is verified that going for a walk i.e. if you spend 20 minutes each day you can reduce the risk of disease by 25-30 percent.",
      "header": "Add Physical Activity In Your Routine",
      "image": "article_30_1.jpg"
    },
    {
      "full_description": "As this is a basic thing that processed foods contain some ingredients which can cause inflammation and make our immune system weak.<br/><br/>Inflammation causes chronic conditions and leads to a lack of energy. That's why it is said that you should try to adopt a diet which adds all the important minerals, vitamins, and fibers. Also full of nutritious and important points try to eat fresh rather than last night one.<br/><br/>Try to maintain a healthy diet that is helpful and should not affect your living. If you’re underweight or your intake of nutrition is bad then your skin can dry up and your soft tissue can lose, if you go deeper you can have wrinkles.",
      "header": "Try to delete processed foods from your diet",
      "image": ""
    },
    {
      "full_description": "Our bodies contain over 60% of water—every cell, tissue, and organ depends on water to function. Drinking water and staying hydrated can slow aging by resulting in tighter, fuller skin and can reduce the risk of medical problems down the road<br/><br/>Keeping your body dehydrated leads to many medical issues like fatigue, lack of focus and headaches but one of the most important things is that dehydration also leads to heart disease, asthma and chronic pain.",
      "header": "Keep Your Body Hydrated",
      "image": ""
    },
    {
      "full_description": "Sleep reduces our abilities to recover lines and wrinkles and premature aging.if we don't get enough sleep then it can lead to health problems including stress, morning drowsiness, and also it  weakens our immune system.",
      "header": "Get your ZZZs properly",
      "image": ""
    },
    {
      "full_description": "Many products contain many antioxidants and retinoic acid (Retin-A) as precautions of aging. A good exfoliator will remove dead and dulling skin cells and allow your new skin cells to come.",
      "header": "Beware of aging products",
      "image": ""
    },
    {
      "full_description": "Stress is one of the main reasons that weakens our  immune system which can cause many health problems. In today’s robotic world, it is easy to get stuck at work and social activities and don't have time for yourself.<br/><br/>If you prioritize your goals then you can surely have less aging issues.",
      "header": "Reduce stress and anxiety",
      "image": ""
    },
    {
      "full_description": "Having healthy relationships improves our physical health. It is said that friendship is a need for human living.<br/><br/>Some studies even showed that if a person stays lonely then it can be worse than anything else. Loneliness can create health problems. Try to keep a healthy and good relationship with people.",
      "header": "Maintain healthy relationships",
      "image": ""
    },
    {
      "full_description": "While working, if you indulge yourself and love whatever you are doing then it will surely make your heart feel alive and lively. It also takes away your stress and you have fewer wrinkles which will surely make you feel better and look great.",
      "header": "Whatever you do try to love your actions and activities",
      "image": ""
    },
    {
      "full_description": "Aging creates many medical risks. If we don’t take better care of ourselves now then our bodies may face premature aging.<br/><br/>Getting older does not mean that you’ll be facing changes only in your body’s cells or tissues and organs because it affects the functioning of all our body parts as well.<br/><br/>Our muscle mass decreases and our metabolism makes us slow in every work which makes us go nearer to chronic issues.Caring about your physical appearance is a must but how you handle the little things in your life brings up a challenge.<br/><br/>Try to boost your self-esteem and confidence levels so that it can positively protect your mental health and quality of life. One should not feel shame if he or she is trying to clear his or her flaws as they are doing for their better life, not for showing others.",
      "header": "",
      "image": ""
    }
  ],
  "title": "Ways To Slow Down Ageing"
}