{"description":"Day by day as we see the increase in health issues every day. As we know, nowadays people watch movies or web series late at night with munchies which usually blames obesity.\n\nBut unacceptable things always happen. In today's living era people don't have time to go out with their loved ones and friends. Even if they have to go, they are stressed for completion of work.\n\nHaving the temptation of food in the middle of the night, that is late-night cravings which happens to even the best of us every once in a while, and is common that our sleeping routine is disrupted. But eating late regularly is really bad for your health.\n\nEating over than your consumption counts on more calories that are consumed at night while your killing your inner soul by waking up till late and not bothering yourself how bad it can affect you. \n\nThe habit of late night binging usually starts with skipping breakfast, eating a petite lunch, and by 8 pm you want to eat everything in sight or even wake up at midnight with food cravings.","details":[{"full_description":"This is one of the most important reasons why late night binging should be avoided late. Eating processed snacks or packed food is the most possible risk that people take for weight gain.<br/><br/>People are aware and it's a fact too that late night binging leads to weight gain but are not aware of it that it can happen.<br/><br/>This is generally caused by the changes in the metabolic functions during our sleeping hours and waking hours. At night, the procedure of our metabolism slows down and the food that we consume is metabolized and digested at a slower rate.<br/><br/>That's why the doctor's prescription says that people should eat their meal at least 2 hours before bed. But if you feel like trying, you must eat food that is low in calories and rich in fibre and easy for consumption.","header":"Weight Gain","image":"article_31_1.jpg"},{"full_description":"Having that eagerness of eating something at night when you feel ridiculous hunger can lead to many issues. Eating food late at night can abruptly affect your sleep cycle.<br/><br/>In that case the digestion of food procedure can take a toll on your sleep cycle in which you will feel difficulty to sleep at night. Try to avoid sugary and oily foods like chocolates, cookies, chips, ice-creams etc. at night as they always disrupt your food cycle.","header":"Creates disturbance in sleep cycle","image":""},{"full_description":"Acid reflux happens when the stomach acid trickles up into the oesophagus after eating. It is often accompanied by a burning sensation in your lower or mid-chest.<br/><br/>Occasional acid reflux or heartburn symptoms rarely occur for giving you a warning and indicates that chronic digestive disorder or GERD—gastroesophageal reflux disease is taking place.<br/><br/>Just after eating if you lie down to bed can trigger your acid reflux or other GERD symptoms. That's why overeating or eating high-fat foods can increase your risk for heart health.","header":"Acid refluxing occurs","image":""},{"full_description":"Some people fall asleep while eating late at night,which leads to a negative effect on sleep quality.<br/><br/>Few researches showed that this activity or pattern of eating can directly be linked to bizarre, disturbing dreams.<br/><br/><b>NOTE:</b> Spicy food and dairy are often the worst offenders in the night.","header":"It Can Cause Disturbed Dreams","image":""},{"full_description":"After reading the information you can figure out how bad late-night eating is i.e. detrimental to your health. Try to avoid these little things so that you should not face any issues. Don't risk your life just for fun.<br/><br/>If you are struggling with eating at night, try to get help sooner rather than later. Most people wait too long to get help or assume that help is not available.","header":"","image":""}],"title":"Side Effects Of Late Night Binging"}