{"description":"","details":[{"full_description":"While chopping onions, they cause watery eyes. However, it provides many health benefits which includes reducing the risk of several types of disease like cancer, improving mood and maintaining skin and hair health.","header":"","image":"article_16_1.jpg"},{"full_description":"Onions contain organic sulfur compounds. Organic sulfur compounds reduce the level of cholesterol and break down blood clots, lowering your risk for heart disease and stroke.","header":"Lower Risk of Heart Disease and Stroke","image":""},{"full_description":"Quercetin and organic sulfur compounds in onions are known to promote insulin production, making them a helpful vegetable choice for those with diabetes","header":"Diabetes Control","image":""},{"full_description":"Onions are full of antioxidants. The essential flavonoid \"Quercetin\" is abundant in all onions. Antioxidant polyphenol Is found in the outer layers of the onion.<br/><br/>Some experts believe that quercetin from onions is absorbed much better by the body than from dietary supplements.","header":"Contains A Package of Antioxidants","image":""},{"full_description":"In addition to reducing free radicals, the active ingredients in onion also develop anti-allergic properties. These effects occur through the stimulation of the immune system, antiviral activities, reduction of proinflammatory cytokines, or histamine release.","header":"Strengthen the Immune System","image":""},{"full_description":"Cancer-fighting properties are linked to the sulfur compounds and flavonoid antioxidants found in allium vegetables.<br/><br/>Onions also contain fisetin and quercetin, flavonoid antioxidants that may inhibit tumor growth.","header":"Cancer- Fighting Properties","image":""},{"full_description":"Onions are a rich source of fiber and prebiotics, which are really needed for gut health. Onions are very rich in the prebiotics inulin and fructooligosaccharides.<br/><br/>Research has shown that these short-chain fatty acids strengthen gut health, boost immunity, reduce inflammation and enhance digestion.","header":"May Boost Digestive Health","image":""},{"full_description":"Onions are quite impressive as they are nutrient-packed and contain powerful compounds. Onions have antibacterial properties and promote digestive health, which also help in improving immune function. They’re versatile and can increase the flavor of any savory dish.","header":"","image":""}],"title":"Benefits Of Onion"}