{"description":"High cholesterol increases the risk of heart disease and heart attack. Cholesterol is a waxy, fat-like substance in your body, your body uses it to safeguard nerves, tissues, your body is having a self-generating system of cholesterol in the liver but we get cholesterol from the food we eat too so adding too much cholesterol can be very dangerous and lead to high cholesterol.\n\nMedications can help in improving your cholesterol but it will not work until you had to make some lifestyle changes to get effective results, There are 2 main types of cholesterol:\n\n  1. Low-density lipoprotein(LDL)-This is considered as bad cholesterol and you need a low level of this type.\n\n  High-Density lipoprotein(HDL)- This helps in removing cholesterol from the bloodstream, this is known as good cholesterol and you need more levels of it.\n\nlet's quickly check out some changes you can adopt to improve your cholesterol :","details":[{"full_description":"Reduce intake of foods which are having saturated fats and eliminate trans fat food items from your diet and try to add foods that are rich in omega-3 fatty acids and increase soluble fiber. What's more, foods with omega3 fatty acids are herring, walnuts, salmon, and flaxseeds.","header":"<b>Add Heart-Healthy Food to your Diet :</b>","image":"article_43_1.jpg"},{"full_description":"It is one of the effective ways to maintain cholesterol level, by exercising regularly your cholesterol will be improved, moderate exercise and yoga can help raise High-density lipoprotein(HDL) cholesterol, Which is been considered as good cholesterol.","header":"<b>Do Exercises and yoga:</b>","image":""},{"full_description":"Smoking cigarettes increase the LDL cholesterol level that is very dangerous for your heart, whereas quitting cigarettes have shown tremendous improvement in your BP and heart rate from the cigarette-induced spike.","header":"<b>Quit Smoking:</b>","image":""},{"full_description":"If you are overweight it is very important for you to reduce the excess fat stored in your body, research has shown that a loss of just 5 to 10 pounds is enough to improve your cholesterol level. If you want to lose weight then you can add the above tips to your lifestyle by eating well and exercising daily often will help you cut down excess stored fat. ","header":"<b>Lose weight:</b>","image":""},{"full_description":"with the above tips, You can lower your bad cholesterol and can increase HDL with simple lifestyle changes, for this you need to eat a healthy diet and need to do yoga and exercise accordingly, and quit bad habits. If still your cholesterol level is high then consult with your doctor about prescription medicines.","header":"","image":""}],"title":"Impressive Lifestyle changes to improve cholesterol"}