{"description":"","details":[{"full_description":"A variety of colorful foods that is rich in antioxidants protects your eyes from many problems. Add foods rich in selenium, vitamin E, vitamin C, alpha-lipoic acid, zinc, and omega-3 can help you and your family in a significant reduction of eye health problems.","header":"","image":"article_6_6.jpeg"},{"full_description":"It is a nutritional powerhouse that may reduce the risk of prostate cancer and age-related macular degeneration (one cup of Bell Pepper provides 100% RDV of vitamins A and C).","header":"Bell Pepper","image":"article_6_1.jpeg"},{"full_description":"Carrots contain a lot of vitamin A, (with vitamins C and E) helps to reduce the impact of both cataracts and age-related macular degeneration.","header":"Carrots","image":"article_6_2.jpeg"},{"full_description":"Fish is rich in omega 3 fatty acids which can protect against cataracts, dry eye syndrome, and even macular degeneration. This omega 3 fatty acid is a healthy fat that results in stronger and healthier eyes by assisting with the flow of intraocular fluid.","header":"Fish","image":"article_6_5.jpeg"},{"full_description":"Spinach, kale, collard greens, and broccoli, are good for healthy eyesight and preventing eye diseases such as cataracts and macular degeneration. Lutein and zeaxanthin can be found in certain greens promote vision and the health of the retina.","header":"Leafy Greens","image":"article_6_9.jpeg"},{"full_description":"Eggs contain lutein and vitamin A, promote eye health and overall functionality. Vitamin A protects against night blindness and dry eyes where the carotenoid, lutein, reduces the risk of macular degeneration, the leading cause of legal blindness. The delicious egg also contains zeaxanthin; an antioxidant found in egg yolk that can help protect eyes against UV radiation from the sun.","header":"Eggs","image":"article_6_3.jpeg"},{"full_description":"Almonds, sunflower seeds, and pecans are all good sources of vitamin E. Vitamin E is a great antioxidant against cataracts and macular degeneration.","header":"Nuts and Seeds","image":"article_6_10.jpeg"},{"full_description":"Rich source of lutein and zeaxanthin (for better absorption eat with olive oil or avocado oil), that protect eye tissues from sunlight damage and reduce the risk of cataracts and macular degeneration.","header":"Kale","image":"article_6_8.jpeg"},{"full_description":"Good source of beta carotene may slow the progress of macular degeneration. Your body converts beta carotene to vitamin A (prevent dry eyes and night blindness). Beta carotene and vitamin A are absorbed best when eaten with a little healthy fat (olive oil).","header":"Sweet Potatoes","image":"article_6_13.jpeg"},{"full_description":"It contains a good amount of vitamin C, an antioxidant that can help lower your risk of cataracts.","header":"Strawberries","image":"article_6_12.jpeg"},{"full_description":"Salmon has omega-3( also in flax and chia seeds) can help you with dry eyes. It is also a good source of vitamin D, which help in protecting against macular degeneration.","header":"Salmon","image":"article_6_11.jpeg"},{"full_description":"Green tea contains called catechins, shows anti-inflammatory, and antioxidant properties.","header":"Green Tea","image":"article_6_7.jpeg"}],"title":"Foods for Healthy Eyes"}