{"description":"Your eyes are the window to your soul, there are lots of things you can do to maintain your eye health & improve your vision, however, these include healthy lifestyle choices like eating well, stop smoking exercise regularly, protecting your eyes from exposure to UV. \nIn a current scenario, most of the people are doing WFH due to which your screen time increases which can cause eye strain, headaches, neck pain, low vision, Here are some tips you can follow to improve your eye vision and eye health.","details":[{"full_description":"Foods that contain all the essential vitamins like A, C, B, E as well as lutein(broccoli) can help your eyes to improve your vision with time, Some of the important food sources of these essential nutrients are \" carrots, red peppers, broccoli, spinach, strawberries, citrus, you can add foods which are rich in omega -3 fatty acids like flaxseed, salmon, etc.","header":"<b>ADD key Vitamins & Minerals in your diet :</b>","image":"article_38_1.jpg"},{"full_description":"The sunglasses are not only to look cool, wearing shades is one of the crucial steps you can take when it comes to improving your vision. You need to buy sunglasses that can block 99%-100% of UVA & UVB rays of sunlight.","header":"<b>Protect your eyes from UVA & UVB Radiation from the sun :</b>","image":""},{"full_description":"While there is no effective exercise for astigmatism, myopia, or hyperopia, there are some eye exercises which if performed with diligence can gradually help in improving your focusing issue and eyestrain. such exercises are \"gentle palm massage, Eye-rolling clockwise & anti-clockwise, Blinking eyes\".","header":"<b>Eye exercises :</b>","image":""},{"full_description":"Smoking reduces your eye vision with time like it has a  negative impact on lungs, teeth, hairs, heart & other body parts, fortunately when you quit smoking from that first hour your eyes, lungs & other body parts start to recover from its effects.","header":"<b>Stop Smoking :</b>","image":""},{"full_description":"Getting good sleep helps your mind & body to work more efficiently, when you're overtired your eyes can be more strained & feel gritty & dry. Getting a good amount of sleep helps in recharging your tired eyes & therefore helps in improving vision.","header":"<b>Get enough sleep:</b>","image":""},{"full_description":"what's more, If your eyes are not working properly due to improper metabolism of vitamin c then you can take \"Indian gooseberry\", also known as \"AMLA\" which is a rich source of vitamin c. Amla helps to improve & preserve eyesight.","header":"","image":""}],"title":"5 Ways to Improve your Eyesight"}