{"description":"Broccoli is closely related to cabbage, cauliflower, Broccoli is loaded with Vitamins, fiber, minerals, and antioxidants. Some varieties of broccoli are calabrese broccoli and sprouting broccoli. \n\nBroccoli also contains protein, carbs, and many other essential nutrients, here are the top health benefits of broccoli:","details":[{"full_description":"One of the biggest point that separates broccoli from the rest of vegetables is its wide range of nutrient content. it is been loaded with vitamins, minerals, fiber, and other bioactive compounds such as carbs. protein, Vitamin C, A, K, B9, Potassium, and so on. Broccoli is a healthy addition to your diet whether taken cooked or raw.","header":"Loaded with nutrients:","image":"article_59_1.jpg"},{"full_description":"Many studies have shown that broccoli might be useful in cancer prevention although more research is needed, broccoli help in certain types of cancer, namely: breast, prostate, stomach, kidney, bladder, and colorectal.","header":"May protect against certain cancers:","image":""},{"full_description":"Broccoli is a good source of fiber and antioxidants, research indicates that high intake of fiber is associated with lower blood sugar as fiber increase the feeling of fullness and reduces your hunger, which leads to lower blood sugar level and improved diabetic control.","header":"Helps control blood sugar:","image":""},{"full_description":"Several studies have suggested that broccoli helps in supporting heart health in many ways, first of all, it helps in elevating LDL \"Bad\" cholesterol and triglycerides levels which are known as the major risk factor for heart disease. also, it helps increase HDL \"Good\" cholesterol levels in people. It helps in improving the overall health of your heart and reduces the risk of strokes.","header":"Improves heart health:","image":""},{"full_description":"What's more, broccoli may help in promoting healthy bones and joints, protect your skin from sun damage, supports a healthy immune system, and may slow down the aging process. please keep in your mind that good health can't be achieved with a single food, broccoli is one of the healthy foods that help you in improving your health. It is very crucial to have a healthy diet plan for more effective goals achievement.","header":"","image":""}],"title":"Health benefits of Broccoli"}