{"description":"Apple is one of the common fruit worldwide, having more than 7000 different cultivators of apple worldwide. Apple is been linked with several health benefits like improved gut health, reduce risk of stroke, Blood pressure diabetes, and many more. \n\nApple is a very good source of fiber, vitamins, and minerals. let's quickly go through the benefits of apple:","details":[{"full_description":"Apple is a good source of fiber and vitamin C, it is a nutrients dense fruit means it will provide lots of nutrients. Apple also contains antioxidants like vitamin E, and polyphenols.","header":"<b>Loaded with nutrients:</b>","image":"article_50_1.jpg"},{"full_description":"If you are looking for a fruit to add to your diet to lose weight then apple is something you can add to your diet as it is rich in fiber and water which gives or increase the feeling of fullness and works as a good strategy to lose weight.","header":"<b>May help in weight loss:</b>","image":""},{"full_description":"Apple is been linked to a lower risk of heart disease as it contains soluble fiber which helps lower your blood cholesterols levels. it also has polyphenol that helps in lowering your blood pressure and reducing the risk of stroke.","header":"<b>Lower risk of Blood pressure and stroke:</b>","image":""},{"full_description":"Eating apple helps in reducing the risk of type 2 diabetes as it contains antioxidants like polyphenols, quercetin, and phloridzin. the anti-inflammatory effect of quercetin reduces insulin resistance, phloridzn reduces sugar intake in the intestines contributing to reducing blood sugar load and reducing its risk.","header":"<b>Reduce type 2 diabetes:</b>","image":""},{"full_description":"Apple has pectin a type of fiber that acts as a prebiotic, it feeds your gut microbiota, which is a good bacteria in the gut. this type of fiber improves gut-friendly bacteria which is why this fruit helps in fighting against chronic disease.","header":"<b>Promote gut health:</b>","image":""},{"full_description":"What's more, apple also helps in preventing certain types of cancer, also it helps in fighting against asthma and keeps your brain healthy. these are some of the crucial benefits of apple.","header":"","image":""}],"title":"Impressive health benefits of apple"}