{"description":"Saffron is considered as one of the most expensive spices in the world, the reason for its shocking prices is its labor-intensive techniques to harvest, Making its production more costly. \nSaffron is harvested from the crocus sativus plant, the dried thread-like part of the flowers(stigma) is been used to make saffron spice, food coloring, medicine. \n\nSaffron has many benefits and people commonly use saffron to fight depression, Alzheimer's disease, menstrual cramps, kill cancer cells, decrease swelling, and act as antioxidants.\n\nCurrently, Saffron is produced by Iran, Greece, Morocco, Spain, Kashmir, and Italy. Out of these countries, Iran is considered the most important producer in terms of volume and quality.","details":[{"full_description":"Many research have shown proof of saffron helps in increasing memory power also helps in enhancing learning power, Saffron extracts having crocin (carotenoid pigment) which is useful for age-related mental impairment.","header":"<b>Increase learning & Memory retention:</b>","image":"article_40_1.jpg"},{"full_description":"Saffron is having a list of antioxidants such are crocin, crocetin, safranal, and kaempferol. Antioxidants help in protecting your body cells against oxidative stress.","header":"<b>Works as a powerful antioxidant:</b>","image":""},{"full_description":"Crocin and crocetin are carotenoid pigments present in saffron are responsible for their red color, both the compounds may have antidepressant properties, help in improving inflammation reduce appetite, and help in weight loss.","header":"<b>Having Anti-depression properties:</b>","image":""},{"full_description":"Saffron is high in antioxidants, which help in neutralizing harmful free radicals, In test-tube studies, saffron shows killing colon cancer cells or suppressing their growth, this effect is also visible in the skin, bone marrow, prostate, lung, breast, cervix, and several other cancer cells.<br/> However, more human research is needed on this please consult with your doctors first before using it.","header":"<b>Having cancer-Fighting properties:</b>","image":""},{"full_description":"Saffron is having a long list of benefits so in this point will try to sum up other crucial benefits of saffron such as reducing heart disease risk, may lower blood sugar levels, improving eyesight in adults, helping in treating PMS symptoms such as irritability, headaches, cravings, pain, anxiety.<br/><br/>what's more Taking a large amount of saffron is unsafe, saffron might lower your blood pressure. please consider the doctor's recommendation on quantity to be taken.","header":"<b>Some more benefits of saffron:</b>","image":""}],"title":"Impressive Health Benefits of Saffron"}