{"description":"","details":[{"full_description":"As we all know, Vitamin C is an important antioxidant and essential tool for protein metabolism and immune function. Basically it's an absorption of iron from plant-based foods.<br/><br/>Vitamin C is naturally present in some foods and also found in dietary supplements.<br/><br/>Vitamin C is also known as ascorbic acid and it is also considered an essential nutrient because it can't be produced or stored.<br/><br/>Vitamin C also plays a crucial role in immune function. The best way to intake vitamin C is food sources i.e. fruits and vegetables.","header":"","image":"article_17_1.jpg"},{"full_description":"Citrus fruits like oranges, lime, and lemon are the best sources of Vitamin C. As they are rich in fibre content and low in calories.<br/><br/>These fibre-packed citrus fruits are also great for your digestive system as they help to keep your bowel movements regular, making them a great addition to a healthy diet.","header":"Oranges","image":""},{"full_description":"Guavas contain large amounts of the antioxidants. Eating just one guava can provide 126 mg of this vitamin to us.<br/><br/>People with high blood pressure and cholesterol should eat it significantly to lower blood pressure and cholesterol levels.","header":"Guavas","image":""},{"full_description":"Consuming kiwi can improve immunity and will reduce oxidative stress and lower cholesterol levels.<br/><br/>It increases blood cell activity, can decrease blood platelet stickiness and triglycerides. A combination of these factors prevents stroke and reduces the risk of blood clots.","header":"Kiwi","image":""},{"full_description":"Brussel sprouts are rich in potassium, fiber, Vitamin A, K, and folate. But few know that it is a good source of Vitamin C as well.<br/><br/>Therefore, consumption of them can greatly reduce the risk of fractures and will also improve the formation of collagen.","header":"Brussel Sprouts","image":""},{"full_description":"This is a fact that we all know that Papaya is good for digestion and contains anti-inflammatory properties as well. This factor is hidden, i.e. it accounts for 97% of one’s daily Vitamin C need.<br/><br/>Eating papaya can especially be useful for patients suffering from mild levels of Alzheimer’s disease.","header":"Papayas","image":""},{"full_description":"They are low in calories but highly rich in vitamin C. As they are loaded with essential nutrients.<br/><br/>They offer several health benefits including increasing iron absorption and improving eye health.","header":"Bell Peppers","image":""},{"full_description":"Tomatoes are an excellent source of vitamin C and other antioxidants. As their water content and fibre is rich.<br/><br/>They are also considered good for the skin and cardiac health. And they are also rich in nutrients. Tomatoes are good for health, they can be eaten raw as well as cooked.","header":"Tomatoes","image":""},{"full_description":"This water-soluble vitamin is an immune-booster and antioxidant powerhouse that promotes great health and youthful, glowing skin.<br/><br/>Vitamin C is stored in a minimum quantity in the body. Hence, to maintain the normal level of Vitamin C, one needs to add various fruits and vegetables loaded with it in your diet.","header":"","image":""}],"title":"Sources of vitamin \"C"}