{"description":"Studies have shown that dark chocolate can improve your heart health and Blood sugar in your body, it is made from the seed of the cocoa tree. Dark chocolate is been loaded with nutrients as well as it is been considered one of the best sources of antioxidants you can find. \n\nRemember, chocolate can be high in sugar content and fat, so enjoy it in limited quantity. If you’re going to indulge, choose chocolate that is at least 70% cocoa.\n\nDark chocolate contains soluble fiber also rich in iron, magnesium, copper, and manganese, here is the list of benefits of dark chocolate:","details":[{"full_description":"The cocoa content present in dark chocolate is a rich source of nutrition like fiber, iron, magnesium, copper, manganese, and so on. also dark chocolate contains small amount of caffeine.","header":"<b>Rich In Nutrition:</b>","image":"article_46_1.jpg"},{"full_description":" In a study cocoa powder was found to increase HDL and decrease oxidized LDL(Bad)cholesterol, It contains powerful antioxidants which protect lipoproteins against oxidative damage.<br/>The flavanols present in dark chocolate can also reduce insulin resistance, which is a common risk factor for heart diseases and diabetes.","header":"<b>Increase HDL and safeguard LDL from oxidation:</b>","image":""},{"full_description":"The compounds found in it appear to be highly protective against the oxidation of LDL, in long run it cause less cholesterol to store in arteries, resulting in a lower risk of heart disease.","header":"<b>Reduce the risk of Heart disease:</b>","image":""},{"full_description":"The flavanol compound present in dark chocolate protects your body from sun damage, studies show that the flavanols from cocoa can help in improving blood flow to the skin and help in protecting your skin from sun damage.","header":"<b>Protect skin from sun damage:</b>","image":""},{"full_description":"What's more, dark chocolate helps in improving brain functioning, it contains stimulants like caffeine and theobromine which may help in improving brain function by increasing blood flow. chocolates usually contain a small amount of sugar and the darker the chocolate the less it will contain sugar.","header":"","image":""}],"title":"Benefits of Dark chocolate"}