{"description":"While we are about to finish our work at the office and think of going home as soon as you can, the only thing you admire the most is the bed.\n\nSleep is the most important part of  every individual. Without proper ZZZs and sound sleep you are not going to have that perfect body gesture the very next day. If you miss one day of sleep or get late for sleep you are gonna face the discomfort of the environment because your body gets distressed and makes you feel exhausted the whole day.\n\nLack of sleep causes more than headache or dark circles. In addition, proper sleep can consolidate emotional stability and aspects of the individual’s memory. Furthermore, it helps in increasing creativity.\n\nHaving a good sleep classifies your living and helps you in increasing productivity and efficiency.","details":[{"full_description":"It's an activity which takes place during sleep where our brain strengthens or helps in consolidation of  memories. When we wake up, again the learning procedure starts, which is retained or remembered.<br/><br/>When you are not able to learn something mentally or physically, you can give 10 to 15 min rest to your mind, feeling the peace around. This will surely bring an impact in proper sleep.","header":"Improves Memory power","image":"article_32_1.jpg"},{"full_description":"Quality sleep not only improves the brain functions but also seen that it helps in athletic and physical performance too.<br/><br/>After all, when you have a good amount of sleep already you feel more energetic. So whenever you are cherishing yourself for a big day or event, trying to lower down your stress will somehow help when taking a quality sleep which may help.","header":"Enhances Creativity And performance","image":""},{"full_description":"Immune system is the only part of the body which maintains our health and protects our body from every infection or virus.But when it gets weak because of lack of sleep or any other other issue you become sick.<br/><br/>As in today's world of living people are working like high technology machines. Nobody has that much time, which is why it’s important to keep it functioning well.<br/><br/>Having enough sleep is linked to your immune system being strong which allows your body to recuperate and restore itself.","header":"Takes care of Immune system","image":""},{"full_description":"Not enough sleep can make it more difficult to control your appetite which can cause you to gain weight.<br/><br/>As our body needs more energy because it’s awake for longer. Some research has even suggested that being sleep-deprived changes your habits. Sleep plays a key role in regulating how your body uses food for energy and getting enough sleep could help to control your weight.","header":"Regulation of body weight","image":""},{"full_description":"Working all day long and having the following workload increases blood pressure and anxiety which leads to high stress hormones.The functions of your body are always on high alert. The stress hormones make it harder for the body to reduce anxiety and do not allow you to sleep.<br/><br/>This is why elongated sleep deprivation can totally spoil your body circulation which increases blood pressure and  later on adds the issue by increasing health diseases.","header":"Stress reliever","image":""},{"full_description":"When your body physically reacts in a different way we sense some type of danger is occurring. Lack of sleep can increase risk of high blood pressure, diabetes and coronary heart disease.<br/><br/>Our nervous system activates the cardiovascular system which increases blood pressure for waking you up. But if you’re being kept awake too often, your body can’t compensate for this rise in blood pressure and your level may remain higher than expected.<br/><br/><b>NOTE:</b> Having high blood pressure is one of the major risk factors for stroke and coronary heart disease.","header":"Keeps your heart healthy","image":""},{"full_description":"It’s not a secret that a bad sleep leaves you grumpy. Just trying to make sure to get enough good sleep can help you in a more positive way. And when you feel the positivity around you it’s likely to be said that it is because of the people around you.<br/><br/>Getting enough sleep can help you out in every worst situation you fall in as that mode of time your body calms down and regains emotional stability again. All these points when combined increases the vulnerability to several diseases. So try to enhance your sleep by getting a sound of ZZZs every night.","header":"","image":""}],"title":"6 Benefits of good sleep"}