{"description":"This leafy vegetable is been counted under superfood as it is loaded with nutrients, vitamins, and minerals such as calcium, magnesium, iron, and antioxidants.\nAlso, spinach helps in reducing blood pressure as well as prevents cancer, apart from this spinach has lot's of health benefits such as:","details":[{"full_description":"Spinach contains a good amount of potassium which is recommended for patients suffering from high blood pressure, Potassium helps in reducing the effects of sodium in the body.","header":"<b>Reduce blood sugar:</b>","image":"article_45_1.jpg"},{"full_description":"Spinach contains calcium and vitamin K that aids in good bone health, spinach helps in strengthening your bone density and helps in improving bone strength.","header":"<b>Increase Bone health:</b>","image":""},{"full_description":"Spinach contains Vitamin A helps in managing mucus membranes and antioxidants such as lutein and zeaxanthin, Which helps in providing good eyesight. It also helps in protecting your eyes from age-related macular degeneration, cataracts, and other eye problem.","header":"<b>Improves your eyes:</b>","image":""},{"full_description":"Spinach is rich in zeaxanthin, carotenoids that help in flushing out free radicals from your body, these free radicals help in building cancer, and consuming spinach on a regular basis may help in reducing the chance of stomach cancer, mouth cancer, and others.","header":"<b>Aids from cancer:</b>","image":""},{"full_description":"Spinach is a great source of vitamin A, E, K, and C which plays a very crucial role in making your hair and skin healthy. ","header":"<b>Aids in Healthy Hair and skin:</b>","image":""},{"full_description":"From reducing the risk of heart disease to reducing cancer symptoms consuming spinach is very good for your health. What's more, spinach also has anti-aging properties, prevents acne, prevents heart diseases also helps in boosting immunity. ","header":"","image":""}],"title":"Impressive health benefits of Spinach"}