{"description":"Kiwi fruit is considered a superfood due to its numerous benefits also kiwi is loaded with vitamins and minerals, the taste of kiwi is sweet and tangy. It is a good source of fiber and also full of nutrients like Vitamin C, K, E, folate, and potassium. \n\nThanks to its different growing locations, kiwis can be in season the whole year, lets quickly check out the benefits of kiwi:","details":[{"full_description":"Debilitating, wheezing, and breathlessness are some common symptoms of asthma, the high amount of vitamin C and antioxidants present in kiwi helps in managing these symptoms, many research have shown that after eating kiwi regularly there are improvements in lungs of a patient.","header":"<b>Help in reducing asthma:</b>","image":"article_47_1.jpg"},{"full_description":"Kiwi is a rich source of vitamin C and Vitamin C is a very essential nutrient when it comes to boosting your immune system, one study has found out that kiwi not only makes our immune system strong but also helps in reducing cold or illness.","header":"<b>Helps in boosting the Immune system:</b>","image":""},{"full_description":"The study shows that eating two or three kiwi a day helps in reducing the risk of blood clotting, as it also helps in managing our blood pressure.","header":"<b>Reduce blood clotting:</b>","image":""},{"full_description":"A study has shown that the bioactive substances in kiwi help in lowering blood pressure, kiwi helps in managing our blood pressure and long term consumption lower the risk of deceased caused by High blood pressure like strokes, heart attacks.","header":"<b>Help in managing blood pressure:</b>","image":""},{"full_description":"Kiwi contains dietary fiber makes it more useful in improving the digestion system, Kiwi contains an enzyme, actinic which helps in breaking down proteins, it is been advised one kiwi after a large meal as it will help in breaking down tough proteins.","header":"<b>Kiwi helps improve Digestion:</b>","image":""},{"full_description":"What's more, Kiwi helps in preventing your eyes from vision loss as well as helps in fighting inflammation, and it helps in improving skin health.","header":"","image":""}],"title":"Health benefits of Kiwi"}