{"description":"Ginger is considered among the healthiest and delicious spices on the planet, Ginger is a flowering plant that originally comes from southeast Asia. Ginger is having lots of ways to be consumed such as fresh, dried, powder, oil form, or juice. Ginger is considered one of the common and crucial ingredients in recipes, it is often called ginger root.\n\nSince ancient times, Indians are using ginger in treating the common cold, sore throat, stomach cramps. Today, hundreds of studies have proven that ginger is having lots of health benefits, some of the top health benefits of ginger include:","details":[{"full_description":"Ginger is been used to reduce digestion problems occurring and stomach pain, It also helps in lower down nausea and reducing vomiting that occurs during pregnancy and after medical treatment such as surgeries and chemotherapy.","header":"<b>Reduce stomach issues:</b>","image":"article_41_1.jpg"},{"full_description":"In studies, it is been proven that ginger helps in reducing the blood sugar level of the body, it helps in reducing cholesterol and triglycerides while also helping in improving insulin sensitivity. It generally helps in Type 2 diabetes more effectively while for type 1 further research is required.","header":"<b>Helps in reducing Blood sugar levels:</b>","image":""},{"full_description":"Ginger is been considered the number one home remedy for the common cold, In research, it is been found that eating fresh ginger strengthens the respiratory system and also protects from respiratory viruses like a common cold.","header":"<b>Cures a common cold :</b>","image":""},{"full_description":"Many of the studies conducted have shown the evidence of ginger's role play in reducing weight in humans as well as in animals even fed with fat diets ginger helps in burning more calories and reducing inflammation.","header":"<b>May help with weight loss:</b>","image":""},{"full_description":"Ginger contains gingerol which is having anti-cancer properties, some studies show that ginger is been useful in pancreatic and liver cancer. However, more studies are needed. ","header":"<b>Help prevent cancer:</b>","image":""},{"full_description":"Ginger is loaded with nutrients and bioactive compounds that are very crucial for your brain and body. just 1-1.5gm Ginger helps in removing morning sickness.","header":"","image":""}],"title":"Health benefits of Ginger"}