{
  "description": "Clean Eating is all about eating more natural than processed like whole foods i.e, vegetables, fruits, whole grains, and healthy fats and proteins. This will help you feel great, better sleep, have clearer skin and less bloating, and a great body and mind. It is all about our thinking that it is tough but this is the most uncomplicated thing to do for our body. Just follow the simple tips given below:",
  "details": [
    {
      "full_description": "To avoid distractions and binge eating this has to be your first step to control yourself. In case of clean eating, actually cleaning out your pantry and refrigerator from processed food. Because you were not able to resist yourself from these processed foods when you get home, hungry after a long day. Make a food timetable for a week that will be a great help. So, takeout a day and buy colored vegetables and fruits for a week ahead. ",
      "header": "Rearrange Your Fridge and Pantry",
      "image": "article_1_7.jpg"
    },
    {
      "full_description": "Eating more fruit and vegetables can help significantly reduce your risk for a number of chronic diseases. The fiber in whole produce also helps keep your microbiome happy, which can reduce your risk for autoimmune diseases, fight off pathogens and infections and even improve your mood.",
      "header": "Load Up On Fruits and Vegetables",
      "image": "article_1_5.jpg"
    },
    {
      "full_description": "While the strictest of clean eating guidelines might make you think this is a raw-food diet, think again. Actually, it is about to eat foods such as fruits, vegetables, lean proteins, whole grains, and healthy fats and limit highly processed snack foods, sweets, and other packaged foods.",
      "header": "Clean Eating Doesn't Mean always Raw",
      "image": "article_1_2.jpg"
    },
    {
      "full_description": "This holds true for this month of clean eating and every meal after that. When you sit down to lunch or dinner, take a look at the ratio of macro nutrients on your plate.vegetables healthy protein whole grain and fruits.",
      "header": "Check Your Plate for Balance",
      "image": "article_1_1.jpg"
    },
    {
      "full_description": "The cleanest whole grains are the ones that touched the least by processing. Whole grains like quinoa, wild rice, oats.",
      "header": "Go Whole Grain",
      "image": "article_1_3.jpg"
    },
    {
      "full_description": "We're not opposed to all processed foods. Processed food at the grocery store is processed beyond the point of recognition.",
      "header": "Watch Out for Processed Foods",
      "image": "article_1_6.jpg"
    },
    {
      "full_description": "Most people eat too many added sugars.  To clean up your diet, cut down on added sugars by limiting sweets like soda, candy, and baked goods. But you don't have to worry as much about naturally occurring sugars in fruit and dairy.<br/><br/>      * Some days will be harder than others, especially at the beginning of this challenge. Push through your cravings, but not hunger. When you're hungry, you eat more \"clean food.\"",
      "header": "Limit Added Sugar",
      "image": "article_1_4.jpg"
    }
  ],
  "title": "30 days challenge for Clean Eating"
}