{
  "description": "Chickpea has a nutty taste and it can be paired with other foods very precisely, chickpea is eaten in middle eastern countries for thousands of years. Chickpea is a rich source of vitamins, minerals, and fiber also contains protein. \n\nChickpea has lots of health-related benefits like weight loss, improve digestion, and many more, let's quickly check out the health benefits of chickpea:",
  "details": [
    {
      "full_description": "Chickpea is a rich source of protein and fiber also contains a good amount of calories per serving, and it contains several other nutrients like carbs, manganese, folate, copper, iron, zinc, magnesium, and many more.",
      "header": "Loaded with nutrients:",
      "image": "article_70_1.jpg"
    },
    {
      "full_description": "Chickpeas are a great source of plant-based protein, it is a very good choice to add to your diet for vegetarians who don't eat meat and animals. Plant-based protein helps in strengthening bone health and aid in weight management.",
      "header": "Rich in plant protein:",
      "image": ""
    },
    {
      "full_description": "Chickpeas may help in weight loss as it is high in protein and fiber which help lower your calorie intake, and help you in feeling full. You can add it to our diet for improved results during weight loss.",
      "header": "Loose weight: ",
      "image": ""
    },
    {
      "full_description": "Due to high fiber chickpea offers several benefits related to your digestive system, chickpea contains mostly soluble fiber. Soluble fiber helps increase the number of healthy bacteria in your gut and prevents from unhealthy bacteria in your gut, this helps in reducing the risk of irritable bowel syndrome(IBS), and colon cancer.",
      "header": "May improve digestion:",
      "image": ""
    },
    {
      "full_description": "Chickpea contains several crucial nutrients which help in improving your brain health like choline which plays an important role in brain function, it also contains magnesium which helps in nerve function, and nutrients like magnesium, selenium, and zinc may help protect against depression and anxiety.",
      "header": "Promote brain health:",
      "image": ""
    },
    {
      "full_description": "What's more, chickpea helps in reducing the risk of several chronic diseases like Type-2 diabetes, heart disease, and cancer also it improves iron deficiency. Add chickpea to your diet initially as try roasting them as a snack or add them to the salad.",
      "header": "",
      "image": ""
    }
  ],
  "title": "Health benefits of Chickpea"
}