{"description":"If you really think that eating healthy is the only thing that keeps you fit and energetic, then you are highly mistaken.\n\nPeople need to pay attention to certain things. If we  commit certain mistakes after having our meal whether it happens often or regularly then you need to stop it. As it is harming your body in a profound manner. \n\nThere are few people who go for a walk just after their meal with a thought that the food will digest. But, let the truth be out that it is a myth.\n\nOur pre-meal and post-meal activities majorly affect our body behaviour.\n\nAlso, going off to bed immediately just after the intake of food is a bad idea. Because many digestive juices go in the opposite direction and the entire digestive process is affected badly.","details":[{"full_description":"Some people like to drink tea at night because they love it or need to work at night or they think that it will be more productive at night.<br/><br/>Tea affects our digestion as it is acidic in nature. But if intaken just after the meal it will make your digestion very slow which can cause bloating.","header":"Avoid The Intake Of Tea Or Coffee","image":"article_28_2.jpg"},{"full_description":"The idea of taking a hot shower may seem tempting. But always stay away as it increases the blood flow to the hands or legs and decreases the flow to the abdomen. It also drops the body’s temperature.","header":"Do Not Take Shower","image":""},{"full_description":"Going for a walk after eating can affect the digestive system.<br/><br/>In other words, it destroys the nutritional value of the meal. The best time will be to take a walk an hour after eating.","header":"No Fast Walking Allowed","image":"article_28_1.jpg"},{"full_description":"Just after having a meal, going to bed directly may create bloating and discomfort.<br/><br/>People who wait for a long period of time to go to bed after having a meal had less risk of experiencing a stroke.","header":"No Sleep Till Food Digestion","image":""},{"full_description":"Don’t you even think about smoking after the meal! Smoking is bad for health and doing it just after a meal, it becomes a killer. It contains at least sixty carcinogens. <br/><br/>Smoking is the most damaging thing you can do to your body and especially to your lungs. Cigarettes can cause cancer.","header":"No Smoking","image":""},{"full_description":"After a heavy breakfast or lunch or snack time your  stomach is already ready to digest the meal you just ate. But if you need to go somewhere and wear tight fitting clothes immediately then the load on your abdomen will increase.<br/><br/>Which will result in heartburn and makes an uncomfortable feeling burning around your chest. Try to wear loose and comfortable clothes. But not too loose as well.","header":"Avoid To Wear Tight Clothes","image":""},{"full_description":"After eating, the blood flows into the digestive tract while the brain gets a smaller amount thus it affects the ability to concentrate. \n\nDriving needs focus and the inability can be dangerous. So do not immediately hit the road just after you have eaten. Wait for at least 30 minutes to 1 hour. <br/><br/>People are concerned about their health as it cannot be buyed from anywhere.<br/><br/>Eating healthy food and watching your calorie intake isn’t enough. While we heard about the benefits of walking, post a meal to help you work up your digestive system and also help in staying active.","header":"Do Not Drive","image":""}],"title":"Things you should never do after eating"}