{"description":"Black alkaline water is a new name trending in the market as many of the celebrities and famous cricketers are using it on a regular basis, let's quickly understand why black alkaline water is getting so much hype and preferred by renowned celebrities.\nExperts says that Black Alkaline water is having more then 70 minerals which is said to have long term health benefits , black water pH level is higher in comparison to normal water.\n\nBlack alkaline water in high in nutrients and minerals which is helpful in high blood pressure,  diabetes, high cholesterol patients.","details":[{"full_description":"The pH level of any food or drinks  defines its property of how alkaline it is, in case of black water the pH level is 7 to 8 which is higher in comparison to normal water,  black water is also known as <b>\"fulvic water\"</b> as it is having fulvic acid(FVA) , Fulvic acid is been traditionally used in chinese medicines as well as in indian ayurvedic medicine for thousand of years.","header":"How is Black alkaline water different from normal water?","image":"article_35_1.jpg"},{"full_description":"<b>Improves hydration</b>  - The water molecules of black water are smaller then normal water which helps in improving hydration in body.<br/><br/><b>Reduce Acidity</b> - It balance the excess acid produced by body and balance pH level of body.<br/><br/><b>Boost immunity</b> - It helps in absorbing essential nutrients from the food we eat which helps in improving our immune system to work more fluently.<br/><br/><b>Improves metabolism</b> - Black water helps in improving digestive system and when the digestive system is working fine your metabolism automatically improves.<br/><br/><b>Anti-aging properties</b> - Black water is very rich in anti-oxidants and minerals.","header":"Top 5 Health benefits of alkaline water","image":""},{"full_description":"Experts still doing more research about the black water long term effects , if you are looking to change your water to black water first consult with your doctor to avoid below side effects :<br/><br/><b>Skin irritation</b> - It is one of the common side effects of drinking black water .<br/><br/><b>Nausea</b> - In some cases user feels very sick & vomit , it is because of rapid shift from normal water.<br/><br/><b>Muscle twitching</b>","header":"Side Effects","image":""}],"title":"Health benefits of black water"}