{"description":"","details":[{"full_description":"In today's world, we people concentrate on diet. But ever thought whatever you are eating is really helping your body or not? And with every single thing needed by a body?<br/><br/>Our body changes every day as the procedure of cell growing, division and dieing goes on <br/>— which depends on protein to supply vital elements to our cells. In this context, we people need to consume enough protein to maintain lean muscle mass and support every single part of our body.It is really important for a person to consume protein every day.<br/><br/>Protein is one of the major nutrients that plays a crucial role in keeping your cells in good shape and maintaining health. It belongs to one of a complex group of molecules in all kinds of work your body does. They make up your hair, nails, bones, and muscles. It's an obvious need that forms you into someone who you are.","header":"The optimal & mandatory nutrient - PROTEIN","image":"article_14_1.jpg"},{"full_description":"It's an essential part of a healthy diet. Proteins are made up of a chemical called amino acids, which our body uses to build and repair muscles and bones and an energy source basically.<br/><br/>Sometimes like carbs and fat, excess protein gets converted and stored as fat. The hidden health dangers due to high protein intake or nutritional supplements are (a) disorders of bone and calcium homeostasis, (b) disorders of renal function, (c) increased cancer risk, (d) disorders of liver function, and (e) precipitated progression of coronary artery disease.<br/><br/>Note: Extra protein is not used efficiently by the body and may impose a metabolic burden on the bones, kidneys, and liver. Moreover, high-protein diets may  increase risk for heart disease due to intakings. Guidelines for diet should adhere closely to what has been clinically proven, and by this standard there is currently no basis to recommend high protein.","header":"","image":"article_14_2.jpg"},{"full_description":"Always remember being healthy is your lifestyle. Feeling good and taking care of your health is really  important for your self-image. Maintaining it in a right way is your responsibility. But how you manage and control your body is your responsibility. <b>EAT WELL AND HAVE A HAPPY HEART.</b>","header":"","image":"article_14_3.jpg"}],"title":"Optimal & mandatory nutrient - PROTEIN"}