[{"icon":"Carrots.jpg","isSingleItem":true,"layout_type":1,"name":"Carrots","properties":["Beta-carotene (convert to vitamin A), help to strengthen the immune system."],"slug":"Carrots"},{"icon":"Garlic.jpg","isSingleItem":true,"layout_type":1,"name":"Garlic","properties":["The cold-fighting compound is allicin, which has antibacterial and antifungal properties and mainly immune-boosting properties."],"slug":"Garlic"},{"icon":"Ginger.jpg","isSingleItem":true,"layout_type":1,"name":"Ginger","properties":["Bioactive compounds are gingerols and shogaols. Helpful in treating and soothing sore throats and host many biological activities that are anticancer, antioxidant, antimicrobial, anti-inflammatory and anti-allergic."],"slug":"Ginger"},{"icon":"Pineapple.jpg","isSingleItem":true,"layout_type":1,"name":"Pineapple","properties":["Pineapples contain bromelain, an enzyme with anti-inflammatory properties. Drinking pineapple (bromelain) juice helps soothe a sore throat."],"slug":"Pineapple"},{"icon":"Coconut_Water.jpg","isSingleItem":true,"layout_type":1,"name":"Coconut Water","properties":["It contains glucose and the electrolytes needed for re-hydration and soothes the sore throat."],"slug":"Coconut_Water"},{"icon":"Banana.jpg","isSingleItem":true,"layout_type":1,"name":"Banana","properties":["Bananas are a good source of calories and nutrients. They can also help relieve nausea and diarrhea."],"slug":"Banana"},{"icon":"Lemon.jpg","isSingleItem":true,"layout_type":1,"name":"Lemon","properties":["High in vitamin C, which keeps the immune system strong and neutralizes the free radicals in your body. This reduced inflammation and swelling."],"slug":"Lemon"},{"icon":"Spinach.jpg","isSingleItem":true,"layout_type":1,"name":"Spinach","properties":["Vitamin A gives the immune system an added boost but also strengthens the mucous membranes to tackle the likes of a runny or blocked nose too."],"slug":"Spinach"},{"icon":"Bell_Pepper.jpg","isSingleItem":true,"layout_type":1,"name":"Bell Pepper","properties":["Vitamin C supports the immune system and it can also help you to get rid of cold too quickly. "],"slug":"Bell_Pepper"},{"icon":"omega3_blueberries.jpg","isSingleItem":true,"layout_type":1,"name":"Blueberries","properties":["Antioxidants also help to protect the body from infection and disease making blueberries the perfect antidote to cold and flu symptoms.  "],"slug":"Blueberries"},{"icon":"fish.jpg","isSingleItem":true,"layout_type":1,"name":"Fish","properties":["Rich in omega 3 that helps to reduce harmful inflammation in the body and reduces the severity of cold symptoms."],"slug":"Fish"}]