[{"icon":"Apple.jpg","isSingleItem":true,"layout_type":1,"name":"Apple","properties":["High in antioxidants, help to prevent and repair oxidation damage and inflammation. They are also full of soluble fiber, which balances blood sugar mood swings."],"slug":"Apple"},{"icon":"Beets.jpg","isSingleItem":true,"layout_type":1,"name":"Beetroot","slug":"Beets"},{"icon":"Carrots.jpg","isSingleItem":true,"layout_type":1,"name":"Carrots","properties":["Orange color from beta-carotene, a powerful antioxidant. It helps in reducing oxidative damage in the brain reveals more mood benefits."],"slug":"Carrots"},{"icon":"Spinach.jpg","isSingleItem":true,"layout_type":1,"name":"Spinach","properties":["Low serotonin levels caused depression. The tryptophan found in spinach helps increase the levels of serotonin and high folate in spinach increase levels of serotonin in the brain."],"slug":"Spinach"},{"icon":"Walnut.jpg","isSingleItem":true,"layout_type":1,"name":"Walnut","properties":["Richest plant sources of omega-3 fatty acids, omega-3 fatty acids support brain function and reduce depression symptoms."],"slug":"Walnut"},{"icon":"Avocado.jpg","isSingleItem":true,"layout_type":1,"name":"Avocado","properties":["They contain healthy fat that your brain needs in order to run smoothly. It contains fat (oleic acid), protein, vitamin K, vitamin B (B9, B6, and B5), vitamin C, low in sugar and high in dietary fiber."],"slug":"Avocado"},{"icon":"omega3_blueberries.jpg","isSingleItem":true,"layout_type":1,"name":"Blueberries","properties":["Highest antioxidant foods. Antioxidants help in the DNA repair. They fix your cells and prevent them from getting cancer and other illnesses."],"slug":"Blueberries"},{"icon":"Onion.jpg","isSingleItem":true,"layout_type":1,"name":"Onion","properties":["Reduced the risk of digestive tract cancers, contains anti-inflammatory flavonoid antioxidants. Food that prevents gut cancer also benefit your mood."],"slug":"Onion"},{"icon":"Tomato.jpg","isSingleItem":true,"layout_type":1,"name":"Tomato","properties":["Tomatoes contain lots of folic acids and alpha-lipoic acid, good for fighting depression. Folic acid can prevent an excess of homocysteine which restricts the production of important neurotransmitters like serotonin, dopamine, and norepinephrine from forming in the body."],"slug":"Tomato"},{"icon":"Lima_Beans.jpg","isSingleItem":true,"layout_type":1,"name":"Lima Beans","properties":["They contain soluble fiber, which lowers cholesterol levels. Good for your mood too because digested slowly, having a stabilizing effect on blood sugar, which promotes satiety."],"slug":"Lima_Beans"},{"icon":"Flaxseed.jpg","isSingleItem":true,"layout_type":1,"name":"Flax Seeds","properties":["Rich in omega-3 fatty acids, having disease-fighting substances, fat in seeds increases the absorption of protective nutrients."],"slug":"Flaxseed"},{"icon":"Mushrooms.jpg","isSingleItem":false,"layout_type":1,"name":"Mushrooms","properties":["They oppose insulin, which lowers blood sugar levels and acts as probiotic to promote healthy gut bacteria. Nerve cells in our gut manufacture around 80 to 90 percent of our body’s serotonin that make your mood happy."],"slug":"Mushrooms"}]