[{"icon":"Carrots.jpg","isSingleItem":true,"layout_type":1,"name":"Carrots","slug":"Carrots"},{"icon":"Celery.jpg","isSingleItem":true,"layout_type":1,"name":"Celery","properties":["Celery contains antioxidants called flavones, they have an important role in lowering blood sugar levels."],"slug":"Celery"},{"icon":"Spinach.jpg","isSingleItem":true,"layout_type":1,"name":"Spinach","properties":["Spinach consumption is associated with lower risk of developing type 2 diabetes. Among diabetics, higher green vegetable intake is associated with lower HbA1c levels."],"slug":"Spinach"},{"icon":"eggs.jpg","isSingleItem":true,"layout_type":1,"name":"Eggs","properties":["High source of biological value protein, good cholesterol, (High-Density Lipoprotein), which is good for heart health. It improves insulin sensitivity. They give satiety and improve blood sugar levels."],"slug":"Eggs"},{"icon":"Quinoa.jpg","isSingleItem":true,"layout_type":1,"name":"Quinoa","properties":["Fiber and protein combination found in quinoa, Satiety and have better blood sugar control. Protein also helps with the uptake of carbohydrates so the body can process them more easily."],"slug":"Quinoa"},{"icon":"omega3_UradDal.jpg","isSingleItem":true,"layout_type":1,"name":"Black Gram Lentils(Urad Dal)","properties":["Lentils are rich in resistant starch. It has a very minimal impact on your blood sugar levels because it passes through the body undigested and ultimately ends up feeding the healthy bacteria at the bottom of your digestive tract. "],"slug":"Black_Gram_Lentils"},{"icon":"Cinnamonspice.jpg","isSingleItem":true,"layout_type":1,"name":"Cinnamon","properties":["Cinnamon is a potent antioxidant activity. Cinnamon may improve blood sugar control, insulin sensitivity, cholesterol and triglyceride levels in type 2 diabetics."],"slug":"Cinnamonspice"},{"icon":"Chiaseeds.jpg","isSingleItem":true,"layout_type":1,"name":"Chia Seeds","properties":["Chia seeds contain high amounts of fiber, are low in digestible carbs and may decrease blood pressure and inflammation."],"slug":"Chiaseeds"},{"icon":"Turmeric.jpg","isSingleItem":true,"layout_type":1,"name":"Turmeric","properties":["The active ingredient, curcumin, can lower inflammation and blood sugar levels. Consume turmeric with piperine (found in black pepper) in order to boost absorption by as much as 2,000%."],"slug":"Turmeric"},{"icon":"salmon.jpg","isSingleItem":true,"layout_type":1,"name":"Salmon","properties":["Salmon have an excellent amount of Omega-3 fatty acids (DHA and EPA) which is good for diabetics. "],"slug":"Salmon"}]