[{"icon":"Beets.jpg","isSingleItem":true,"layout_type":1,"name":"Beetroot","slug":"Beets"},{"icon":"Carrots.jpg","isSingleItem":true,"layout_type":1,"name":"Carrots","slug":"Carrots"},{"icon":"green_apple.jpg","isSingleItem":true,"layout_type":1,"name":"Green Apple","slug":"Green_Apple"},{"icon":"Lemon.jpg","isSingleItem":true,"layout_type":1,"name":"Lemon","properties":["Lemons boost your metabolism and provide enough potassium to help improve brain and nerve function."],"slug":"Lemon"},{"icon":"Spinach.jpg","isSingleItem":true,"layout_type":1,"name":"Spinach","properties":["Iron helps red blood cells in transporting oxygen to different parts of the body and gives a quick iron boost. Spinach also contains magnesium, for the energy process of the body."],"slug":"Spinach"},{"icon":"Banana.jpg","isSingleItem":true,"layout_type":1,"name":"Banana","properties":["Great natural energy booster and also contains tyrosine, an amino acid that helps produce norepinephrine, which can help improve your level of alertness."],"slug":"Banana"},{"icon":"Watermelon.jpg","isSingleItem":true,"layout_type":1,"name":"Watermelon","properties":["Watermelon is 90% water, which helps prevent dehydration and is a good source of energy."],"slug":"Watermelon"},{"icon":"Crimini.jpg","isSingleItem":true,"layout_type":1,"name":"Crimini","properties":["Great source of the B vitamins riboflavin, pantothenic acid, and niacin, and are a good source of thiamin, vitamin B6, and folate. “B vitamins are essential for energy production. Riboflavin helps to produce energy. Pantothenic acid fights fatigue during times of stress by supporting the adrenal glands, and niacin helps convert food into usable energy. "],"slug":"Crimini"},{"icon":"SweetPotato.jpg","isSingleItem":true,"layout_type":1,"name":"Sweet Potato","properties":["Potassium helps keep electrolytes balanced. Potassium helps relax the body and lower blood pressure."],"slug":"SweetPotato"},{"icon":"green_tea.jpg","isSingleItem":true,"layout_type":1,"name":"Green Tea","properties":["Tea contains the amino acid theanine, which may improve attention and alertness."],"slug":"Green_Tea"},{"icon":"Chiaseeds.jpg","isSingleItem":true,"layout_type":1,"name":"Chia Seeds","properties":["Chia seeds give you stable energy because of their great ratio of protein, fats, and fiber combined."],"slug":"Chiaseeds"},{"icon":"eggs.jpg","isSingleItem":true,"layout_type":1,"name":"Eggs","properties":["Eggs are also an excellent source of iron, protein, antioxidants, and numerous vitamins can be consumed safely even by diabetics without increasing the cardiovascular risk."],"slug":"Eggs"}]