[{"icon":"Carrots.jpg","isSingleItem":true,"layout_type":1,"name":"Carrots","slug":"Carrots"},{"icon":"Lemon.jpg","isSingleItem":true,"layout_type":1,"name":"Lemon","properties":["The alkaline effect of lemon water also neutralizes stomach acid and improves digestion. "],"slug":"Lemon"},{"icon":"Peppermint.jpg","isSingleItem":true,"layout_type":1,"name":"Peppermint","slug":"Peppermint"},{"icon":"Pineapple.jpg","isSingleItem":true,"layout_type":1,"name":"Pineapple","slug":"Pineapple"},{"icon":"Banana.jpg","isSingleItem":true,"layout_type":1,"name":"Banana","properties":["Due to their high-fiber content, bananas also can help strengthen your digestive system. One soluble fiber found in bananas is pectin, which helps move stomach contents through your digestive tract."],"slug":"Banana"},{"icon":"CorianderSeeds.jpg","isSingleItem":true,"layout_type":1,"name":"Coriander Seeds","properties":["Coriander seeds are known for their antispasmodic and anti-inflammatory properties that relieve from upset stomach or indigestion. Coriander consists of essential oil called urandrol that detoxifies the liver and increases appetite, curing indigestion."],"slug":"CorianderSeeds"},{"icon":"Carom.jpg","isSingleItem":true,"layout_type":1,"name":"Carom seeds(Ajwain)","properties":["Carom seed is known to cure various digestive disorders including indigestion, acidity, flatulence. The active enzymes in ajwain help in boosting the digestive system."],"slug":"Carom"},{"icon":"Goose_Berries.jpg","isSingleItem":true,"layout_type":1,"name":"Goose Berries(Amla)","properties":["Indian gooseberry has various aphrodisiac, diuretic, laxative, carminative, antibacterial, anti-inflammatory and antiviral properties. These properties help stimulate your digestive process, further curing indigestion, heartburn or acidity."],"slug":"Goose_Berries"},{"icon":"Chamomile.jpg","isSingleItem":true,"layout_type":1,"name":"Chamomile Tea","properties":["This tea will quickly dispel the dyspeptic feeling. Relieve in various stomach issues."],"slug":"Chamomile"},{"icon":"Ginger.jpg","isSingleItem":true,"layout_type":1,"name":"Ginger","properties":["Ginger has long been associated with curing indigestion. It contains antioxidants including gingerols that are known for relieving indigestion and nausea."],"slug":"Ginger"},{"icon":"FennelSeeds.jpg","isSingleItem":true,"layout_type":1,"name":"Fennel Seeds","properties":["Fennel seeds consist of oil compounds including fenchone and estragole prevent from removing the gas from the intestinal tract. It also has antispasmodic properties that help to relax muscle cells that line the respiratory system, stomach, and intestines."],"slug":"FennelSeeds"}]