[{"icon":"Carrots.jpg","isSingleItem":true,"layout_type":1,"name":"Carrots","slug":"Carrots"},{"icon":"Cilantro.jpg","isSingleItem":true,"layout_type":1,"name":"Cilantro","slug":"Cilantro"},{"icon":"Cucumber.jpg","isSingleItem":true,"layout_type":1,"name":"Cucumber","slug":"Cucumber"},{"icon":"Watermelon.jpg","isSingleItem":true,"layout_type":1,"name":"Watermelon","properties":["Gentle source of hydration full of anti-inflammatories and antioxidants. Watermelon also contains lycopene. They help cleanse the kidneys, blood, and bladder."],"slug":"Watermelon"},{"icon":"Grape.jpg","isSingleItem":true,"layout_type":1,"name":"Grapes","properties":["Grapes contain a compound called resveratrol that is able to lower kidney inflammation."],"slug":"Grape"},{"icon":"Bell_Pepper.jpg","isSingleItem":true,"layout_type":1,"name":"Bell Pepper","properties":["Low in potassium, helpful for people having kidney disease. It also contains lycopene, a powerful antioxidant that keeps kidneys healthy and prevents renal failure."],"slug":"Bell_Pepper"},{"icon":"Cabbage.jpg","isSingleItem":true,"layout_type":1,"name":"Cabbage","properties":["Cabbage is rich in fiber, folate, B6, vitamin C, and vitamin K. The fiber in cabbage and other leafy greens slow the absorption of nutrients. This gives the liver and kidneys time to deal with the influx into the bloodstream."],"slug":"Cabbage"},{"icon":"Mustard_Greens.jpg","isSingleItem":true,"layout_type":1,"name":"Mustard Greens","properties":["Rich in vitamin C, folate, fiber, vitamin K, and many other phytonutrients that reduce stress on the kidneys."],"slug":"Mustard_Greens"},{"icon":"Garlic.jpg","isSingleItem":true,"layout_type":1,"name":"Garlic","properties":["Garlic contains allicin. Allicin is an organic sulfur compound that has some mighty anti-inflammatory properties."],"slug":"Garlic"},{"icon":"Apple.jpg","isSingleItem":true,"layout_type":1,"name":"Apple","properties":["The fiber in apples is helpful in removing toxins from the digestive tract before the body can absorb them, lessening the load on the kidneys. "],"slug":"Apple"},{"icon":"Rasp_Berry.jpg","isSingleItem":true,"layout_type":1,"name":"Raspberry","properties":["They reduce inflammation and contain vitamin C, fiber, folate, and manganese. Raspberries also contain ellagic acid, an antioxidant that has been shown to prevent kidney disease and some cancers."],"slug":"Rasp_Berry"},{"icon":"Ginger.jpg","isSingleItem":true,"layout_type":1,"name":"Ginger","properties":["It also has been shown to protect the kidneys from damage caused by diabetes, alcohol, and dehydration. Ginger, when combined with thyme, may offer even more protection."],"slug":"Ginger"}]