[{"icon":"Beets.jpg","isSingleItem":true,"layout_type":1,"name":"Beetroot","properties":["Beetroot help in memory and concentration. Natural nitrates present in beets also help in boosting the blood flow in the brain. This helps in promoting the brain functions, all of these results in improved brain functions."],"slug":"Beets"},{"icon":"Grape.jpg","isSingleItem":true,"layout_type":1,"name":"Grapes","slug":"Grape"},{"icon":"Pomegranate.jpg","isSingleItem":true,"layout_type":1,"name":"Pomegranate","slug":"Pomegranate"},{"icon":"salmon.jpg","isSingleItem":true,"layout_type":1,"name":"Salmon","properties":["Rich in heart-healthy omega-3 fatty acids, including docosahexaenoic acid (DHA). DHA is very important for the normal functioning of neurons."],"slug":"Salmon"},{"icon":"Avocado.jpg","isSingleItem":true,"layout_type":1,"name":"Avocado","properties":["It improves brain function. Avocados contain folate and Vitamin K, which is a vitamin for memory and focus that helps in preventing blood clots in the brain. It also helps in improving the cognitive function of the brain by boosting concentration and memory."],"slug":"Avocado"},{"icon":"Chamomile.jpg","isSingleItem":true,"layout_type":1,"name":"Chamomile Tea","properties":["Helps you sleep better and boost your cognitive abilities. It also contains vitamins to improve focus and is considered one of the best foods for your brain."],"slug":"Chamomile"},{"icon":"Broccoli.jpg","isSingleItem":true,"layout_type":1,"name":"Broccoli","properties":["It has high levels of choline and Vitamin K that help in keeping your memory sharp and make it one of the best foods for brain health. It is also high in compounds called glucosinolates. These compounds improve brain power and cognitive functions."],"slug":"Broccoli"},{"icon":"omega3_blueberries.jpg","isSingleItem":true,"layout_type":1,"name":"Blueberries","properties":["It contains higher levels of gallic acid, which protect the brain from stress and degeneration. This acid also helps to get rid of toxic proteins that are associated with age-related memory loss."],"slug":"Blueberries"},{"icon":"eggs.jpg","isSingleItem":true,"layout_type":1,"name":"Eggs","properties":["Eggs are rich in Vitamin D, which help improve the brain’s cognitive skills. It is one of the most essential vitamins to help focus and memory. Egg yolks contain significant amounts of choline that help develop the fetal brain in pregnant women."],"slug":"Eggs"},{"icon":"Walnut.jpg","isSingleItem":true,"layout_type":1,"name":"Walnut","properties":["Rich in omega-3 fatty acids. Walnuts contain high levels of vitamins, minerals, and antioxidants that help in promoting mental alertness. The Vitamin E present in walnuts can help in keeping Alzheimer’s disease at bay."],"slug":"Walnut"},{"icon":"Spinach.jpg","isSingleItem":true,"layout_type":1,"name":"Spinach","properties":["Spinach is packed with Vitamin K, helpful for memory and focus. Spinach is also rich in Vitamin A that helps in reducing inflammation of the brain cells."],"slug":"Spinach"},{"icon":"Pumpkin_Seeds.jpg","isSingleItem":true,"layout_type":1,"name":"Pumpkin Seeds","properties":["Rich in Zinc, which helps in promoting learning capacity and memory efficiency. It also contains magnesium, tryptophan, and Vitamin B, which aid in relieving stress and improving your mood."],"slug":"Pumpkin_Seeds"}]