[{"icon":"Carrots.jpg","isSingleItem":true,"layout_type":1,"name":"Carrots","slug":"Carrots"},{"icon":"Celery.jpg","isSingleItem":true,"layout_type":1,"name":"Celery","slug":"Celery"},{"icon":"Pomegranate.jpg","isSingleItem":true,"layout_type":1,"name":"Pomegranate","slug":"Pomegranate"},{"icon":"kale_alkaline.jpg","isSingleItem":true,"layout_type":1,"name":"Kale","properties":["Rich in beta-carotene and vitamin E, boost antioxidant levels and support optimal brain functioning."],"slug":"Kale"},{"icon":"Almonds.jpg","isSingleItem":true,"layout_type":1,"name":"Almonds","properties":["High in magnesium, helpful for anxiety-related symptoms by increasing the level of the neurotransmitter serotonin in the brain. "],"slug":"Almonds"},{"icon":"omega3_blueberries.jpg","isSingleItem":true,"layout_type":1,"name":"Blueberries","properties":["Blueberries are bursting with antioxidants and vitamin C which have been shown to provide anxiety relief."],"slug":"Blueberries"},{"icon":"Asparagus.jpg","isSingleItem":true,"layout_type":1,"name":"Asparagus","properties":["Asparagus contains a good amount of mood-boosting nutrient that is folate value."],"slug":"Asparagus"},{"icon":"BrazilNuts.jpg","isSingleItem":true,"layout_type":1,"name":"Brazil Nuts","properties":["High in selenium. Selenium may improve mood by reducing inflammation, which is often at heightened levels when someone has a mood disorder, such as anxiety. Brazil nuts and other nuts are also a good source of vitamin E. It is beneficial for treating anxiety."],"slug":"BrazilNuts"},{"icon":"Turmeric.jpg","isSingleItem":true,"layout_type":1,"name":"Turmeric","properties":["The active ingredient in turmeric is called curcumin. An increase of curcumin in the diet also increased DHA and reduced anxiety."],"slug":"Turmeric"},{"icon":"Pumpkin_Seeds.jpg","isSingleItem":true,"layout_type":1,"name":"Pumpkin Seeds","properties":["Pumpkin seeds are an excellent source of potassium, which helps regulate electrolyte balance and manage blood pressure. Zinc is essential for brain and nerve development."],"slug":"Pumpkin_Seeds"},{"icon":"eggs.jpg","isSingleItem":true,"layout_type":1,"name":"Eggs","properties":["It contains tryptophan, which is an amino acid that helps create serotonin. Serotonin is a chemical neurotransmitter that helps to regulate mood, sleep, memory, and behavior. Serotonin is also thought to improve brain function and relieve anxiety."],"slug":"Eggs"},{"icon":"Chamomile.jpg","isSingleItem":true,"layout_type":1,"name":"Chamomile Tea","properties":["Chamomile tea as an herbal remedy because of its anti-inflammatory, antibacterial, antioxidant, and relaxant properties."],"slug":"Chamomile"},{"icon":"green_tea.jpg","isSingleItem":true,"layout_type":1,"name":"Green Tea","properties":["Green tea contains an amino acid called theanine. Theanine has anti-anxiety and calming effects and may increase the production of serotonin and dopamine."],"slug":"Green_Tea"}]